----------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  s:\dan\Paper - Forbes\ReplicationPackage\log/clean_city_names15 Dec 2021.log
  log type:  text
 opened on:  15 Dec 2021, 12:50:31

. *cd "C:\Users\Annemarie\Documents\Forbes_400"
. *Needed to call fred through firewall
. *set httpproxyhost l1proxy.frb.org
. *set httpproxyport 8080
. *set httpproxy on 
. 
. *ssc install egenmore
. 
. 
. *Some name cleaning. Needs a loop once I find patterns!
. *Dataset set with person, 
. use "./data/stata_data/forbes400_DW_EM_long.dta", clear

. 
. g Residence2 = Residence
(400 missing values generated)

. replace Residence2 = "New York" if regexm(Residence2, "37")==1
(1 real change made)

. egen test = noccur(Residence2), string(",")

. g city = substr(Residence2, 1, strpos(Residence2, ",")-1) if test>=1
(4,892 missing values generated)

. replace city = Residence2 if test<1
variable city was str34 now str45
(4,492 real changes made)

. 
. g temp_city = city
(400 missing values generated)

. replace temp_city = strproper(strtrim(subinstr(subinstr(subinstr(subinstr(temp_city,"•", "", .),".", " ", .),"*", " ", .),"  ", " ",  
> .)))
(1,049 real changes made)

. replace city = strproper(strtrim(subinstr(subinstr(subinstr(subinstr(city,"•", "", .),".", " ", .),"*", " ", .),"  ", " ",  .)))
(1,049 real changes made)

. #delimit
delimiter now ;
. replace temp_city = "New York" if regexm(city, "N.Y")==1 | regexm(city, "NYC")==1 |
>  regexm(city, "New York")==1 | regexm(city, "Ny")==1 | regexm(city, "Nyc")==1 |  regexm(city, "N YC,")==1 | regexm(city, "N.YC")==1 |
>   regexm(city, "NyC")==1 
>   | regexm(city, "NY")==1 
> ;
(961 real changes made)

. replace temp_city = "Atlanta" if regexm(city, "Atlanta")==1;
(1 real change made)

. replace temp_city = "Beverly Hills" if regexm(city, "Beverly Hills")==1 |  regexm(city, "Beverlyhills")==1;
(12 real changes made)

. replace temp_city = "Bloomfield Hills" if regexm(city, "Bloomfield")==1;
(2 real changes made)

. replace temp_city = "Southern California" if regexm(city, "Southern Calif")==1;
(8 real changes made)

. replace temp_city = "Chicago" if regexm(city, "Chicago")==1;
(32 real changes made)

. replace temp_city = "Los Angeles" if regexm(city, "Los Angeles")==1 | regexm(city, "L A")==1;
(29 real changes made)

. replace temp_city = "Wayzata" if regexm(city, "Wayzara")==1;
(1 real change made)

. replace temp_city = "Wayzata" if regexm(city, "Wayzara")==1;
(0 real changes made)

. replace temp_city = "Westchester" if regexm(city, "Westchester")==1;
(17 real changes made)

. replace temp_city = "Washington" if regexm(city, "Washington")==1;
(8 real changes made)

. replace temp_city = "Wynnewood" if regexm(city, "Wynewood")==1  ;
(2 real changes made)

. replace temp_city = "St Mary's" if regexm(city, "St Mary'S Point")==1 | regexm(city, "St Mary's Point")==1 | 
> regexm(city, "St Marys Point")==1 | regexm(city, "St Mary’s Point")==1 ;
(16 real changes made)

.  replace temp_city = "St Paul" if regexm(city, "St. Paul")==1 | regexm(city, "St Paul")==1 ;
(5 real changes made)

.  compress;
  variable family was float now byte
  variable statefips1 was float now byte
  variable statefips2 was float now byte
  variable statefips3 was float now byte
  variable lastname was str26 now str16
  variable firstname was str41 now str17
  variable Age was str44 now str9
  variable Residence was str60 now str53
  variable Education was str53 now str43
  variable suffix was str13 now str8
  variable Other was str1614 now str1613
  variable A was str51 now str41
  variable st was str45 now str15
  (2,221,920 bytes saved)

. replace temp_city = "St Louis" if regexm(city, "St.Louis")==1 | regexm(city, "St Louis")==1 | 
> regexm(city, "St Louis")==1  ;
(3 real changes made)

.  replace temp_city  = "Strafford" if regexm(city, "Stratford")==1;
(1 real change made)

. replace temp_city = "Seattle" if regexm(city, "Seattle")==1 ;
(7 real changes made)

.  replace temp_city = "Santa Clara" if regexm(city, "Santa Clara")==1 ;
(9 real changes made)

.  replace temp_city = "Santa Ana" if regexm(city, "Santa Ana")==1 ;
(1 real change made)

.  replace temp_city = "Sioux Falls" if regexm(city, "Sious Falls")==1 ;
(1 real change made)

.  replace temp_city = "San Antonio" if regexm(city, "San Antonio")==1 | regexm(city, "San Anotonio")==1 ;
(4 real changes made)

.  replace temp_city = "San Francisco" if regexm(city, "San Francisco")==1 | regexm(city, "Sf")==1 | regexm(city, "San Fancisco")==1   ;
(10 real changes made)

.  replace temp_city = "Sacramento" if regexm(city, "Sacramento")==1 ;
(6 real changes made)

.  replace temp_city = "Rancho Santa Fe" if regexm(city, "Rachosanta")==1 ;
(0 real changes made)

.  replace temp_city = "Racine" if regexm(city, "Racine")==1 | regexm(city, "Rachine")==1 ;
(1 real change made)

.  replace temp_city = "Puerto Rico" if regexm(city, "Puerto Rico")==1  ;
(5 real changes made)

.  replace temp_city = "Prairie Village" if regexm(city, "Prairie Village")==1 | regexm(city, "Prarie Village")==1   ;
(1 real change made)

. replace temp_city = "Pittsburgh" if regexm(city, "Pittsburgh")==1   ;
(12 real changes made)

. replace temp_city = "Philadelphia" if regexm(city, "Philadelphia")==1 | regexm(city, "Phila. Area")==1   ;
(10 real changes made)

. replace temp_city = "Palm Beach" if regexm(city, "Palm Beach")==1   ;
(44 real changes made)

. replace temp_city = "Palo Alto" if regexm(city, "Palo Al To")==1   ;
(1 real change made)

. replace temp_city = "Pacific Palisades" if regexm(city, "Palisades")==1   ;
(7 real changes made)

. replace temp_city = "Boston" if regexm(city, "Boston")==1   ;
(31 real changes made)

. replace temp_city = "Corning" if regexm(city, "Corning")==1   ;
(2 real changes made)

. replace temp_city = "Minneapolis" if regexm(city, "Minneapoli")==1   ;
(9 real changes made)

. replace temp_city = "Miami" if regexm(city, "Miami")==1  ;
(79 real changes made)

.  replace temp_city = "Miami Beach" if regexm(city, "Miami Beach")==1 | regexm(city, "Miamibeach")==1 ;
(60 real changes made)

.  replace temp_city = "Memphis" if regexm(city, "Memphis")==1  ;
(1 real change made)

.  replace temp_city = "Lutherville" if regexm(city, "Lutherville")==1  ;
(2 real changes made)

.  replace temp_city = "Cincinnati" if regexm(city, "Cincinnati")==1 | regexm(city, "Cincinnati")==1 ;
(7 real changes made)

.  replace temp_city = "Bedminster" if regexm(city, "Bedmisnter")==1  ;
(1 real change made)

.  replace temp_city = "Artesia" if regexm(city, "Arteisa")==1  ;
(1 real change made)

.  replace temp_city = "Orange County" if regexm(city, "Orange County")==1 | regexm(city, "Orange Co")==1;
(1 real change made)

. replace temp_city = "Oklahoma City" if regexm(city, "Oklahoma City")==1;
(4 real changes made)

. replace temp_city = "West Hollywood" if regexm(city, "West Hollywood")==1;
(0 real changes made)

. replace temp_city = "Malibu" if regexm(city, "Mailibu")==1;
(1 real change made)

. replace temp_city = "Newtown Square" if regexm(city, "Newtown Square")==1 | regexm(city, "Newton Square")==1;
(4 real changes made)

. replace temp_city = "Newton Centre" if regexm(city, "Newton Centre")==1 | regexm(city, "Newton Center")==1;
(2 real changes made)

. replace temp_city = "Hopkinton" if regexm(city, "Hopkington")==1  ;
(1 real change made)

.  replace temp_city = "Mount Kisco" if regexm(city, "Mt Kisco")==1  ;
(14 real changes made)

. replace temp_city = "Harrison" if regexm(city, "Harrison")==1  ;
(6 real changes made)

.  replace temp_city = "Southampton" if regexm(city, "Southampton")==1  ;
(10 real changes made)

.  replace temp_city = "Scarsdale" if regexm(city, "Scarsdale")==1  ;
(8 real changes made)

.  replace temp_city = "Rye" if regexm(city, "Rye")==1  ;
(11 real changes made)

.  replace temp_city = "Greenwich" if regexm(city, "Greenwich")==1  ;
(6 real changes made)

.  replace temp_city = "Long Island" if regexm(city, "Long Island")==1  ;
(1 real change made)

.  replace temp_city = "Upper Brookville" if regexm(city, "Upper Brookville")==1  ;
(3 real changes made)

. replace temp_city = "Boca Raton" if regexm(city, "Boca Raton")==1  ;
(2 real changes made)

. replace temp_city = "Upper Brookville" if regexm(city, "Upper Brookville")==1  ;
(0 real changes made)

. replace temp_city = "Deal" if regexm(city, "Deal")==1  ;
(3 real changes made)

. replace temp_city = "Nashua" if regexm(city, "Nashuah")==1  ;
(1 real change made)

. replace temp_city = "Nanjin" if regexm(city, "Nanjing")==1  ;
(9 real changes made)

. replace temp_city = "Montchanin" if regexm(city, "Montchamin")==1 | regexm(city, "Montchanin")==1 ;
(2 real changes made)

. replace statefips2 = . if Name == "Irenee Du Pont" & statefips2 == 30;
(1 real change made, 1 to missing)

. replace temp_city = "Livingston" if regexm(city, "Livingston")==1  ;
(1 real change made)

. replace temp_city = "Louisville" if regexm(city, "Louisville")==1  ;
(1 real change made)

. replace temp_city = "Las Vegas" if regexm(city, "Las Vegas")==1 |  regexm(city, "Lasvegas")==1;
(8 real changes made)

. replace temp_city = "Lake Forest" if regexm(city, "Lake Forest")==1 |  regexm(city, "Lake Forrest")==1;
(1 real change made)

. replace temp_city = "Dallas" if regexm(city, "Dllas")==1  | 
> regexm(city, "Dallas")==1 & regexm(city, "Lake")!=1;
(15 real changes made)

. replace temp_city = "Kansas City" if regexm(city, "Kansas City")==1  | 
> regexm(city, "Kansascity")==1 | regexm(city, "Kan City")==1;
(2 real changes made)

. replace temp_city = "Indianapolis" if regexm(city, "Indianapolis")==1 ;
(3 real changes made)

. replace temp_city = "Irvine" if regexm(city, "rvine")==1 ;
(1 real change made)

. replace temp_city = "Houston" if regexm(city, "Houston")==1 ;
(10 real changes made)

. replace temp_city = "Honolulu" if regexm(city, "Honolulu")==1 ;
(10 real changes made)

. replace temp_city = "Baltimore" if regexm(city, "Baltimore")==1 ;
(4 real changes made)

. replace temp_city = "Holmby Hills" if regexm(city, "Hombly Hills")==1 ;
(1 real change made)

. replace temp_city = "Paso Robles" if regexm(city, "Paso Robles")==1 ;
(4 real changes made)

. replace temp_city = "Fort Worth" if regexm(city, "Fort Worth")==1 |regexm(city, "Forth Worth")==1 |
> regexm(city, "Ft Worth")==1 | (regexm(city, "Ft")==1 & regexm(city, "Worth")==1) ;
(26 real changes made)

. replace temp_city = "Fort Collins" if regexm(city, "Fort Collins")==1 |
> regexm(city, "Ft Collins")==1 | (regexm(city, "Ft")==1 & regexm(city, "Collins")==1) ;
(0 real changes made)

. replace city = "Corpus Christi" if 
>   regexm(city, "Corpus Christi")==1;
(0 real changes made)

. /*
> replace temp_city = "Grosse Pointe Farms" if regexm(city, "Gross Pointe Farms")==1 |
> regexm(city, "Gross Point Farms")==1 | regexm(city, "Gro Sse Pointe Farms") | regexm(city, "Grosse Point Farms")==1  |
> regexm(city, "Gross Point Farms")==1  ;  
> compress;
> replace temp_city = "Grosse Pointe" if regexm(city, "Grosse Point Shores")==1 |
> regexm(city, "Gro Sse Pointe Shores")==1 | regexm(city, "Grosse Point Shores") | regexm(city, "Grosse Pointe Shore")==1  | regexm(city
> , "Grosse Pte Shores")==1 
> | regexm(city, "Gross Point Shores")==1 | regexm(city, "Gross Pointe Shores")  ;  
> */
> replace temp_city = "Grosse Pointe" if strmatch(temp_city,"*Gross* Point*");
(62 real changes made)

. replace temp_city = "Greenwood Village" if   regexm(city, "Greenwood")==1;
(1 real change made)

. replace temp_city = "Grand Rapids" if   regexm(city, "Grand Rapids")==1;
(1 real change made)

. replace temp_city = "Fort Lauderdale" if regexm(city, "Fort Lauderdale")==1 |
> regexm(city, "Ft Lauderdale")==1 | (regexm(city, "Ft")==1 & regexm(city, "Lauderdale")==1) ;
(6 real changes made)

.   replace temp_city = "Fort Smith" if regexm(city, "Fort Smith")==1 |
> regexm(city, "Ft Smith")==1 | (regexm(city, "Ft")==1 & regexm(city, "Smith")==1) ;
(2 real changes made)

.    replace temp_city = "Fort Mill" if regexm(city, "Fort Mill")==1 |
> regexm(city, "Ft Mill")==1 | (regexm(city, "Ft")==1 & regexm(city, "Mill")==1) ;
(1 real change made)

.  replace temp_city = "Fort Pierce" if regexm(city, "Fort Pierce")==1 |
> regexm(city, "Ft Pierce")==1 | (regexm(city, "Ft")==1 & regexm(city, "Pierce")==1) ;
(1 real change made)

.       replace temp_city = "Englewood" if   regexm(city, "Englewood")==1;
(3 real changes made)

.   replace temp_city  = "Detroit" if   regexm(city, "Detroit")==1;
(9 real changes made)

. replace temp_city  = "Denver" if   regexm(city, "Denver")==1;
(6 real changes made)

.   replace temp_city  = "Cleveland" if regexm(city, "Cleveland")==1;
(14 real changes made)

.     replace temp_city  = "Columbus" if regexm(city, "Columbus")==1;
(1 real change made)

. replace temp_city  = "Eightyfour" if regexm(city, "Eighty-Four")==1;
(2 real changes made)

. replace temp_city  = "Buffalo" if regexm(city, "Buffalo")==1;
(2 real changes made)

. replace temp_city  = "Bentonville" if   regexm(city, "Bentonville")==1;
(1 real change made)

. replace temp_city  = "Chestnut Hill" if   regexm(city, "Chestnut Hill")==1;
(1 real change made)

. replace temp_city = "Devils Tower" if regexm(city, "Devils Tower")==1 |
> regexm(city, "Devil'S Tower")==1 | regexm(city, "Devil'S Tower") | regexm(city, "Devil’S Tower")==1   ;
(5 real changes made)

.   replace temp_city = "Charlotte" if (regexm(Residence, "Charlotte")==1 & regexm(Residence, "Charlottesville")!=1 );
(1 real change made)

. replace temp_city = "Nashville-Davidson" if regexm(Residence, "Nashville")==1 & (statefips1==47 | statefips2==47 | statefips3==47) ;
(67 real changes made)

. *Recodes based on initial merge. These are unincorporated places in the Forbes 400 data.
> ;
. *CHANGED BASED ON GOOGLE SEARCH. LA JOLLA IS A PART OF SAN DIEGO
> ;
. replace temp_city = "San Diego" if regexm(city, "La Jolla")==1 |  regexm(city, "Lajolla")==1;
(71 real changes made)

. *Upperville, VA is unincorporated
> ;
. replace temp_city = "Fauquier" if regexm(city, "Upperville")==1;
(21 real changes made)

. replace temp_city = "Washington" if (regexm(city, "Washington")==1 & statefips1==11 );
(1 real change made)

. *Places w/o a specific city/county/MSA
> ;
. replace temp_city = "" if regexm(city, "Australia")==1 | regexm(city, "Bahamas")==1| 
> (regexm(city, "D")==1 & strlen(city)<2) | regexm(city, "Zug")==1 | regexm(city, "X")==1 |
> regexm(city, "Virginia; S C")==1 | regexm(city, "Virginia; California")==1  | 
> regexm(city, "Versailles")==1 | (regexm(city, "Va")==1& strlen(city)<3) |
> regexm(city, "Us Virgin Islands")==1 | regexm(city, "Texas")==1 |
> regexm(city, "Switzerland")==1 | regexm(city, "Sr")==1 | regexm(city, "Unknown")==1 |
> regexm(city, "Southern California")==1 | regexm(city, "Scattered")==1 | 
> (regexm(city, "San Juan")==1 & regexm(city, "San Juan Capistrano")!=1 & regexm(city, "San Juan Islands")!=1) | 
> regexm(city, "Residence Unknown")==1 | regexm(city, "Origin: Fla")==1 | 
> regexm(city, "Orig Florida")==1 | regexm(city, "North Carolina; Conn")==1 | 
> regexm(city, "New Jersey")==1 | regexm(city, "Nanjin")==1 | 
> (regexm(city, "Na")==1 & strlen(city)<3)
> | regexm(city, "N/A")==1 | regexm(city, "N Carolina")==1 | regexm(city, "Meggen")==1 | 
> regexm(city, "Meggan")==1 | regexm(city, "Meggan")==1 | regexm(city, "Meggan")==1 | statefips1==100
> | regexm(city, "Conn")==1 | regexm(city, "Delaware")==1 | regexm(city, "Europe")==1 |
> regexm(city, "Florida")==1 | regexm(city, "Delaware")==1 | regexm(city, "Illinois")==1 |
> regexm(city, "Nebraska")==1 | (regexm(city, "Idaho")==1 & regexm(city, "Falls")!=1) |
> regexm(city, "Hawaii")==1 | regexm(city, "London")==1 | regexm(city, "Penn")==1 |
> regexm(city, "Southeast")==1 | regexm(city, "Calif")==1 | regexm(city, "-")==1 |
> regexm(city, "Wyoming")==1 | regexm(city, "Calif")==1 | regexm(city, "-")==1 
> ;
(420 real changes made)

. *Adjust for Winrock Farms for Rockefellers
> ;
. replace temp_city = "Conway County" if regexm(city, "Winrock Farm")==1;
(10 real changes made)

. /*
> *Fix name from Cherry Hill to Cherry Hills
> ;
> replace temp_city = "Cherry Hills Village" if regexm(city, "Cherry Hill")==1 & statefips1==8 ;
> *Fix Indian Hills Colorado. It is a designated place in Jefferson County
> ;
> replace temp_city = "Jefferson County" if (regexm(city, "Indian Hills")==1 & statefips1==8 );
> 
> *Fix Rancho Santa Fe CA. It is a neighborhood in San Diego
> ;
> replace temp_city = "San Diego" if regexm(city, "Rancho Santa Fe")==1 & statefips1==6 ;
> replace temp_city = "San Diego" if regexm(city, "Racho Santa Fe")==1 & statefips1==6 ;
> 
> 
> *Fix Pacific Palisads CA. It is a neighborhood in LA
> ;
> replace temp_city = "Los Angeles" if regexm(city, "Pacific Palisads")==1 & statefips1==6 ;
> replace temp_city = "Los Angeles" if regexm(city, "Hollywood")==1 & statefips1==6 ;
> replace temp_city = "Napa" if regexm(city, "Napa Valley")==1 & statefips1==6 ;
> */;
. *Fix Bel Air CA. It is a neighborhood in LA
> ;
. replace temp_city = "Los Angeles" if regexm(city, "Bel Air")==1 & statefips1==6 ;
(82 real changes made)

. /*Excel file fixes from locality_misses*/;
. replace temp_city = "Bal Harbour" if regexm(city, "Bal Harbor")==1;
(5 real changes made)

. replace temp_city = "Miami" if regexm(city, "Coconut Grove")==1;
(7 real changes made)

. replace temp_city = "Carpinteria" if regexm(city, "Carpentiria")==1;
(1 real change made)

. replace temp_city = "Los Angeles" if regexm(city, "Chatsworth")==1;
(1 real change made)

. replace temp_city = "Cherry Hills" if regexm(city, "Cherry Hill")==1;
(2 real changes made)

. replace temp_city = "Cohassett" if regexm(city, "Cohasset")==1;
(12 real changes made)

. replace temp_city = "Corning" if regexm(city, "Coming")==1;
(2 real changes made)

. replace temp_city = "Newport Beach" if regexm(city, "Corona Del Mar")==1;
(1 real change made)

. replace temp_city = "Crown Point" if regexm(city, "Crew Point")==1;
(1 real change made)

. replace temp_city = "Daytona Beach" if regexm(city, "Daytona")==1;
(4 real changes made)

. replace temp_city = "Los Angeles" if regexm(city, "Encino")==1;
(5 real changes made)

. replace temp_city = "Fort Lauderdale" if regexm(city, "For Lauderdale")==1;
(1 real change made)

. replace temp_city = "Fort Lauderdale" if regexm(city, "Ft. Lauderdale")==1;
(0 real changes made)

. replace temp_city = "Fort Lauderdale" if Name == "Horvitz" & statefips1 == 12;
(5 real changes made)

. replace temp_city = "Cleveland" if Name == "Horvitz" & statefips1 == 39;
(0 real changes made)

. replace temp_city = "Roseburg" if regexm(city, "Roseberg")==1;
(1 real change made)

. replace temp_city = "San Marino" if regexm(city, "San Manno")==1;
(2 real changes made)

. replace temp_city = "Redwood" if regexm(city, "Silicon Valley")==1;
(2 real changes made)

. replace temp_city = "Los Angeles" if regexm(city, "Venice")==1;
(3 real changes made)

. // Added in an attempt to get missing people from 2001 and 2011 to show up
> replace temp_city = "Philadelphia" if regexm(city, "Wynewood") == 1;
(2 real changes made)

. replace temp_city = "San Mateo" if regexm(city, "Hillsborough") == 1;
(21 real changes made)

. replace temp_city = "Los Angeles" if regexm(city, "Pacific Palisades") == 1 & statefips1 == 6;
(18 real changes made)

. replace temp_city = "Los Angeles" if regexm(city, "Palisades") == 1 & statefips1 == 6;
(5 real changes made)

. replace temp_city = "Reno" if regexm(city, "Lake Tahoe") == 1;
(3 real changes made)

. replace temp_city = "Sands Point" if regexm(city, "Long Island") == 1;
(15 real changes made)

. replace temp_city = "Grosse Point" if regexm(city, "Grosse Pointe Shores") == 1;
(25 real changes made)

. replace temp_city = "Singapore" if regexm(Residence, "Singapore, N/A") == 1;
(2 real changes made)

. replace temp_city = "Rancho Santa Fe" if regexm(Residence, "Racho Santa Fe") == 1 & statefips2 == 6;
(0 real changes made)

. replace statefips2 = . if Name == "Gwendolyn Sontheim Meyer";
(1 real change made, 1 to missing)

. replace statefips3 = . if regexm(Residence, "California, Nyc Area, Et Al.") == 1 & Name == "William Randpolph Hearst Jr";
(0 real changes made)

. g missing_vals = (temp_city=="");

. compress;
  variable missing_vals was float now byte
  variable temp_city was str45 now str21
  (416,610 bytes saved)

. #delimit cr;
delimiter now cr
. 
. 
. // Generating multi city variables
. save "./data/stata_data/temp_city_1_generated.dta", replace
file ./data/stata_data/temp_city_1_generated.dta saved

. 
. // Drop all observations that do not have a second state code
. keep if statefips2 != .  
(15,168 observations deleted)

. 
. // Generate tempcity variables
. // All of the states are backwards from the city order, so if Cleveland comes first, its state is being read as Florida
. 
. generate temp_city_2 = temp_city if statefips3 == . 
(43 missing values generated)

. 
. // Fixing temp_city variable where reverse state is not the case
. replace temp_city_2 = "New York City" if regexm(Residence, "California, Nyc Area, Et Al.") == 1 & Name == "William Randolph Hearst Jr"
(1 real change made)

. replace temp_city_2 = "Purchase" if regexm(Residence, "Purchase") == 1 & statefips2 == 36
(1 real change made)

. replace temp_city_2 = "New York City" if regexm(Residence, "New York City") & statefips2 == 36
(13 real changes made)

. replace temp_city_2 = "New York City" if regexm(Residence, "NYC") & statefips2 == 36
(34 real changes made)

. replace temp_city_2 = "Newport" if regexm(Residence, "Newport") & statefips2 == 44
(4 real changes made)

. replace temp_city_2 = "Houston" if regexm(Residence, "Houston") == 1 & statefips2 == 48
(3 real changes made)

. replace temp_city_2 = "Puerto Rico" if regexm(Residence, "Puerto Rico") == 1 & statefips2 == 100
(3 real changes made)

. replace temp_city_2 = "Cheyenne" if regexm(Residence, "Cheyenne") == 1 & statefips2 == 56
(1 real change made)

. replace temp_city_2 = "Las Vegas" if regexm(Residence, "Las Vegas") == 1 & statefips2 == 32
(7 real changes made)

. replace temp_city_2 = "Middleburg" if regexm(Residence, "Middleburg") == 1 & statefips2 == 51
(1 real change made)

. replace temp_city_2 = "London" if regexm(Residence, "London") == 1 & statefips2 == 100
(6 real changes made)

. replace temp_city_2 = "East Hampton" if regexm(Residence, "East Hampton") == 1 & statefips2 == 36
(1 real change made)

. replace temp_city_2 = "Jacksonville" if regexm(Residence, "Jacksonville") == 1 & statefips2 == 12
(1 real change made)

. replace temp_city_2 = "Tacoma" if regexm(Residence, "Tacoma") == 1 & statefips2 == 53
(4 real changes made)

. replace temp_city_2 = "Monaco" if regexm(Residence, "Monaco") == 1 & statefips2 == 100
(6 real changes made)

. replace temp_city_2 = "Kansas City" if regexm(Residence, "Mission Hills, Mo.") == 1 & statefips2 == 29
(1 real change made)

. replace temp_city_2 = "New Orleans" if regexm(Residence, "New Orleans") == 1 & statefips2 == 22
(1 real change made)

. replace temp_city_2 = "Warrenton" if regexm(Residence, "Upperville") == 1 & statefips2 == 51
(1 real change made)

. replace temp_city_2 = "Orlando" if regexm(Residence, "Orlando") == 1 & statefips2 == 12 
(3 real changes made)

. replace temp_city_2 = "Detroit" if regexm(Residence, "Detroit, New York City, Palm Beach") == 1 
(1 real change made)

. replace temp_city_2 = "Oklahoma City" if regexm(Residence, "Oklahoma City") == 1 & statefips2 == 40
(4 real changes made)

. replace temp_city_2 = "New York City" if regexm(Residence, "New York") == 1 & statefips2 == 36 & Name == "Jeanette Annenberg Hooker"
(1 real change made)

. replace temp_city_2 = "New York City" if regexm(Residence, "New York") == 1 & statefips2 == 36 & Name == "Lita Annenberg Hazen"
(1 real change made)

. replace temp_city_2 = "New York City" if regexm(Residence, "New York") == 1 & statefips2 == 36 & Name == "Donald Leroy Bren"
(1 real change made)

. replace temp_city_2 = "Washington" if regexm(Residence, "Washington, D.C.") == 1 & Name == "Joe Lewis Allbritton"
(3 real changes made)

. replace temp_city_2 = "New York City" if regexm(Residence, "New York") == 1 & statefips2 == 36 & Name == "Leon Hess"
(1 real change made)

. replace temp_city_2 = "Duluth" if regexm(Residence, "Duluth") == 1 & statefips2 == 27
(2 real changes made)

. replace temp_city_2 = "New York City" if regexm(Residence, "New York") == 1 & statefips2 == 36 & Name == "Jack Parker"
(1 real change made)

. replace temp_city_2 = "Somerville" if regexm(Residence, "Somerville, N.J., Newport, R.I., Honolulu") == 1
(1 real change made)

. replace temp_city_2 = "New York City" if regexm(Residence, "New York") == 1 & statefips2 == 36 & Name == "Leonard Davis"
(1 real change made)

. replace temp_city_2 = "" if regexm(Residence, "Palm Beach, Fla. and New York") == 1 & Name == "Robert Olnick"
(1 real change made)

. replace temp_city_2 = "Gasparilla Island" if regexm(Residence, "Gasparilla Island") == 1 
variable temp_city_2 was str16 now str17
(2 real changes made)

. replace temp_city_2 = "New York City" if regexm(Residence, "New York") == 1 & statefips2 == 36 & Name == "Mary Jane Du Pont Lunger"
(1 real change made)

. replace temp_city_2 = "Boston" if regexm(Residence, "New York, Boston and Washington, D.C.") == 1
(1 real change made)

. replace temp_city_2 = "Highlands" if regexm(Residence, "Highlands") == 1 & statefips2 == 37
(1 real change made)

. replace temp_city_2 = "" if regexm(Residence, "New York") == 1 & statefips2 == 36 & Name == "Sherman Cohen"
(1 real change made)

. replace temp_city_2 = "" if regexm(Residence, "Washington, D.C., and Idaho") == 1 & Name == "Catherine Mellon Conover"
(1 real change made)

. replace temp_city_2 = "New York City" if regexm(Residence, "New York") == 1 & Name == "Armand Hammer"
(1 real change made)

. replace temp_city_2 = "New York City" if regexm(Residence, "Nyc") == 1 & Name == "Donald Leroy Bren" & statefips2 == 36
(2 real changes made)

. replace temp_city_2 = "New York City" if regexm(Residence, "Nyc") == 1 & statefips2 == 36
(10 real changes made)

. replace temp_city_2 = "New York City" if regexm(Residence, "New York") == 1 & statefips2 == 36 & Name == "Sherman Cohen"
(1 real change made)

. replace temp_city_2 = "Minneapolis" if regexm(Residence, "Minneapolis") == 1 & statefips2 == 27 
(2 real changes made)

. replace temp_city_2 = "New York City" if regexm(Residence, "Nyc") == 1 & Name == "Max Martin Fisher"
(1 real change made)

. replace temp_city_2 = "Detroit" if regexm(Residence, "Detroit") == 1 & statefips2 == 26
(3 real changes made)

. replace temp_city_2 = "" if regexm(Residence, "Centreville, Del.; Fla.") == 1 & statefips2 == 12
(1 real change made)

. replace temp_city_2 = "Baltimore" if regexm(Residence, "Baltimore") == 1 & statefips2 == 24
(1 real change made)

. replace temp_city_2 = "Seattle" if regexm(Residence, "Seattle") == 1 & statefips2 == 53
(1 real change made)

. replace temp_city_2 = "Boston" if regexm(Residence, "Nyc, Boston, Wash., D.C.") == 1
(1 real change made)

. replace temp_city_2 = "Houston" if regexm(Residence, "Houston; Washington, D.C.") == 1
(1 real change made)

. replace temp_city_2 = "Cleveland" if regexm(Residence, "Cleveland Area") == 1
(1 real change made)

. replace temp_city_2 = "Chicago" if regexm(Residence, "Chicago") == 1
(1 real change made)

. replace temp_city_2 = "Mclean" if regexm(Residence, "Mclean") == 1
(1 real change made)

. replace temp_city_2 = "Philadelphia" if regexm(Residence, "Phila. Area; Nyc; Et Al.") == 1
(1 real change made)

. replace temp_city_2 = "" if regexm(Residence, "Centreville, Del.; Florida") == 1
(1 real change made)

. replace temp_city_2 = "" if regexm(Residence, "St. Paul; Wash. State") == 1
(1 real change made)

. replace temp_city_2 = "" if regexm(Residence, "Denver; Fla") == 1
(1 real change made)

. replace temp_city_2 = "" if regexm(Residence, "Middleburg, Va., Calif.") == 1
(1 real change made)

. replace temp_city_2 = "" if regexm(Residence, "Washington, District Of Columbia") == 1 & Name == "Steven M Rales"
(1 real change made)

. replace temp_city_2 = "" if regexm(Residence, "N/A") == 1
(5 real changes made)

. replace temp_city_2 = "Rancho Santa Fe" if regexm(Residence, "Racho Santa Fe") == 1 & statefips2 == 35
(0 real changes made)

. replace temp_city_2 = "" if regexm(Residence, "Newport Beach, Florida") == 1
(2 real changes made)

. replace temp_city_2 = "Cleveland" if Name == "Horvitz" & statefips2 == 39
(4 real changes made)

. replace temp_city_2 = "Buffalo" if regexm(Residence, "Palm Beach, Florida; Buffalo, New York.") == 1
(1 real change made)

. replace statefips2 = 36 if regexm(Residence, "Palm Beach, Florida; Buffalo, New York.") == 1
(0 real changes made)

. 
. // Fixing temp_city_2 and state
. replace temp_city_2 = "Lyford Cay" if regexm(Residence, "Lyford Cay") == 1
(1 real change made)

. replace statefips2 = 100 if temp_city_2 == "Lyford Cay"
(0 real changes made)

. 
. replace temp_city_2 = "" if regexm(Residence, "Westchester Cty., N.Y") == 1
(2 real changes made)

. replace statefips2 = . if regexm(Residence, "Westchester Cty., N.Y") == 1
(2 real changes made, 2 to missing)

. 
. replace temp_city_2 = "" if regexm(Residence, "Vero Beach, California") == 1
(1 real change made)

. replace statefips2 = 6 if regexm(Residence, "Vero Beach, California") == 1
(1 real change made)

. 
. replace temp_city_2 = "" if regexm(Residence, "Portland, Me.; Florida") == 1
(1 real change made)

. replace statefips2 = 12 if regexm(Residence, "Portland, Me.; Flordia") == 1
(0 real changes made)

. 
. replace temp_city_2 = "" if regexm(Residence, "Charlottesville, Va., and New York") == 1
(1 real change made)

. replace statefips2 = 36 if regexm(Residence, "Charlottesville, Va., and New York") == 1
(1 real change made)

. // Generating temp_city_3 variable 
. generate temp_city_3 = temp_city if statefips3 != . & statefips3 != 100
(256 missing values generated)

. 
. // Fixing temp_city_3
. replace temp_city_3 = "Newport Beach" if regexm(Residence, "Newport Beach and Los Angeles, Calif., and New York") == 1 
variable temp_city_3 was str10 now str13
(1 real change made)

. replace temp_city_3 = "Newport" if regexm(Residence, "Newport") == 1
(10 real changes made)

. replace temp_city_3 = "New York City" if regexm(Residence, "New York") == 1 & statefips2 == 36 & Name == "Mortimer Benjamin Zuckerman"
(1 real change made)

. replace temp_city_3 = "New York City" if regexm(Residence, "Nyc") == 1 & statefips2 == 36 & Name == "Mortimer Benjamin Zuckerman"
(0 real changes made)

. replace temp_city_3 = "Moscow" if regexm(Residence, "Moscow") == 1 & statefips3 == 100
(3 real changes made)

. replace temp_city_3 = "Los Angeles" if regexm(Residence, "Newport Beach, L.A., Nyc") == 1 
(1 real change made)

. replace temp_city_3 = "Paris" if regexm(Residence, "London, Paris, Connecticut") == 1
(1 real change made)

. replace temp_city_3 = "Moscow" if regexm(Residence, "L.A.; Nyc; Moscow") == 1
(1 real change made)

. replace temp_city_3 = "Moscow" if regexm(Residence, "L.A., Nyc, Moscow") == 1
(1 real change made)

. replace temp_city_3 = "" if regexm(Residence, "Newport Beach, Florida") == 1
(2 real changes made)

. 
. // Fixing temp_city_3 variable where third residence is abroad
. replace temp_city_3 = "London" if regexm(Residence, "London") & statefips3 == 100
(1 real change made)

. 
. // Replace temp_city with second residence. Doing this manually which isn't the most efficient.
. replace temp_city = "Palm Beach" if regexm(Residence, "Palm Beach") == 1 & statefips1 == 6
(0 real changes made)

. replace temp_city = "Los Angeles" if regexm(Residence, "Los Angeles") == 1 & statefips1 == 6
(7 real changes made)

. replace temp_city = "Greenwich" if regexm(Residence, "Greenwich") == 1 & statefips1 == 9
(1 real change made)

. replace temp_city = "Palm Beach" if regexm(Residence, "Palm Beach") == 1 & statefips1 == 12
(13 real changes made)

. replace temp_city = "Rancho Mirage" if regexm(Residence, "Rancho Mirage") == 1 & statefips1 == 6
(3 real changes made)

. replace temp_city = "New York City" if regexm(Residence, "NYC") == 1 & statefips1 == 36
(20 real changes made)

. replace temp_city = "Washington" if regexm(Residence, "Washington, D.C.") == 1 & statefips1 == 11
(2 real changes made)

. replace temp_city = "Fort Lauderdale" if regexm(Residence, "Fort Lauderdale") == 1 & statefips1 == 12
(0 real changes made)

. replace temp_city = "Santa Barbara" if regexm(Residence, "Santa Barbara") == 1 & statefips1 == 6
(2 real changes made)

. replace temp_city = "Wilmington" if regexm(Residence, "Wilmington") == 1 & statefips1 == 10
(3 real changes made)

. replace temp_city = "Montecito" if regexm(Residence, "Montecito") == 1 & statefips1 == 6
(2 real changes made)

. replace temp_city = "Palm Springs" if regexm(Residence, "Palm Springs") == 1 & statefips1 == 6
(6 real changes made)

. replace temp_city = "Santa Fe" if regexm(Residence, "Santa Fe") == 1 & statefips1 == 35
(2 real changes made)

. replace temp_city = "Pittsburgh" if regexm(Residence, "Pittsburgh") == 1 & statefips1 == 42
(1 real change made)

. replace temp_city = "St. Paul" if regexm(Residence, "St. Paul") == 1 & statefips1 == 27
(8 real changes made)

. replace temp_city = "Beverly Hills" if regexm(Residence, "Beverly Hills") == 1 & statefips1 == 6
(2 real changes made)

. replace temp_city = "San Diego" if regexm(Residence, "RanchoSanta Fe") == 1 & statefips1 == 6
(1 real change made)

. replace temp_city = "Bridgewater" if regexm(Residence, "Bridgewater") == 1 & statefips1 == 9
(1 real change made)

. replace temp_city = "Westport" if regexm(Residence, "Westport") == 1 & statefips1 == 9
(1 real change made)

. replace temp_city = "Honolulu" if regexm(Residence, "Honolulu") == 1 & statefips1 == 15
(7 real changes made)

. replace temp_city = "New York City" if regexm(Residence, "New York City") == 1 & statefips1 == 36
(3 real changes made)

. replace temp_city = "Cohasset" if regexm(Residence, "Cohasset") == 1 & statefips1 == 12
(2 real changes made)

. replace temp_city = "Sanford" if regexm(Residence, "Sanford") == 1 & statefips1 == 12
(1 real change made)

. replace temp_city = "Boca Raton" if regexm(Residence, "Boca Raton") == 1 & statefips1 == 12
(1 real change made)

. replace temp_city = "Nantucket" if regexm(Residence, "Nantucket") == 1 & statefips1 == 25
(2 real changes made)

. replace temp_city = "" if regexm(Residence, "Charlottesville, Va., and New York") == 1 & statefips1 == 36
(1 real change made)

. replace temp_city = "Sarasota" if regexm(Residence, "Sarasota") == 1 & statefips1 == 12
(2 real changes made)

. replace temp_city = "San Diego" if regexm(Residence, "La Jolla") == 1 & statefips1 == 6
(1 real change made)

. replace temp_city = "Scottsdale" if regexm(Residence, "Scottsdale") == 1 & statefips1 == 4
(2 real changes made)

. replace temp_city = "Emerald Bay" if regexm(Residence, "Emerald Bay") == 1 & statefips1 == 6
(1 real change made)

. replace temp_city = "Manalapan" if regexm(Residence, "Manalapan") == 1 & statefips1 == 12
(1 real change made)

. replace temp_city = "Washington" if regexm(Residence, "Wash., D.C.") == 1 & statefips1 == 11
(2 real changes made)

. replace temp_city = "Miami Beach" if regexm(Residence, "Miami Beach") == 1 & statefips1 == 12
(1 real change made)

. replace temp_city = "Versailles" if regexm(Residence, "Versailles") == 1 & statefips1 == 21
(1 real change made)

. replace temp_city = "Hollywood" if regexm(Residence, "Hollywood") == 1 & statefips1 == 12
(1 real change made)

. replace temp_city = "Atlanta" if regexm(Residence, "Atlanta") == 1 & statefips1 == 13
(1 real change made)

. replace temp_city = "New York City" if regexm(Residence, "Nyc Area") == 1 & statefips1 == 36
(1 real change made)

. replace temp_city = "Hobe Sound" if regexm(Residence, "Hobe Sound") == 1 & statefips1 == 12
(1 real change made)

. replace temp_city = "New York City" if regexm(Residence, "Nyc") == 1 & statefips1 == 36
(5 real changes made)

. replace temp_city = "Bal Harbour" if regexm(Residence, "Bal Harbour") == 1 & statefips1 == 12
(2 real changes made)

. replace temp_city = "" if regexm(Residence, "Columbus, Ohio; Calif.") == 1 & statefips1 == 6
(2 real changes made)

. replace temp_city = "Des Moines" if regexm(Residence, "Des Moines") == 1 & statefips1 == 19
(1 real change made)

. replace temp_city = "" if regexm(Residence, "Portland, Me.; Florida") == 1
(1 real change made)

. replace temp_city = "Colorado Springs" if regexm(Residence, "Colorado Spgs.") == 1 & statefips1 == 8
(1 real change made)

. replace temp_city = "" if regexm(Residence, "Racho Santa Fe, California") == 1 & statefips1 == 6
(0 real changes made)

. replace temp_city = "" if regexm(Residence, "Vero Beach, California") == 1 & statefips1 == 6
(1 real change made)

. 
. // Fixing temp_city and state 
. replace temp_city = "Sundance" if regexm(Residence, "Devil's Tower") == 1
(1 real change made)

. replace statefips1 = 56 if temp_city == "Devil's Tower"
(0 real changes made)

. 
. replace statefips1 = 36 if regexm(Residence, "Westchester Cty., N.Y") == 1
(2 real changes made)

. replace temp_city = "White Plains" if regexm(Residence, "Westchester Cty.") == 1 & statefips1 == 36
(2 real changes made)

. 
. replace temp_city_2 = "" if regexm(Residence, "Columbus, Ohio; Calif.") == 1
(2 real changes made)

. replace statefips2 = 6 if regexm(Residence, "Columbus, Ohio; Calif.") == 1
(2 real changes made)

. // Replacing Puerto Rico with correct Statefips code
. replace statefips1 = 72 if regexm(temp_city, "Puerto Rico") == 1 & statefips1 == 100
(0 real changes made)

. replace statefips2 = 72 if regexm(temp_city_2, "Puerto Rico") == 1 & statefips2 == 100
(3 real changes made)

. replace statefips3 = 72 if regexm(temp_city_3, "Puerto Rico") == 1 & statefips3 == 100
(0 real changes made)

. 
. 
. // Fixing misc. errors
. replace temp_city_2 = "" if temp_city == "Hunterdon Cty" 
(1 real change made)

. replace statefips1 = 34 if temp_city == "Hunterdon Cty"
(1 real change made)

. replace statefips2 = . if temp_city_2 == ""
(43 real changes made, 43 to missing)

. replace temp_city = "Flemington" if temp_city == "Hunterdon Cty"
(1 real change made)

. replace temp_city_3 = "Australia" if regexm(Residence, "Australia, London, New York City") == 1
(1 real change made)

. replace statefips3 = 100 if temp_city_3 == "Australia" 
(1 real change made)

. replace temp_city_3 = "New York City" if regexm(Residence, "New York City") == 1 & statefips3 == 36
(1 real change made)

. replace statefips3 = 6 if temp_city_3 == "Newport Beach"
(0 real changes made)

. // Fixing statefips2 
. replace statefips2 = 32 if regexm(Residence, "Nev.") == 1
(6 real changes made)

. replace statefips2 = 32 if regexm(Residence, "Nevada") == 1
(0 real changes made)

. replace statefips2 = 51 if regexm(Residence, "VA.") == 1
(1 real change made)

. replace statefips2 = 39 if regexm(Residence, "Delaware, Ohio") == 1
(4 real changes made)

. replace statefips2 = 26 if temp_city_2 == "Detroit"
(0 real changes made)

. replace statefips2 = 11 if temp_city_2 == "Washington"
(2 real changes made)

. replace statefips2 = 34 if temp_city_2 == "Somerville"
(0 real changes made)

. replace statefips2 = 25 if temp_city_2 == "Boston"
(0 real changes made)

. replace statefips2 = 16 if regexm(Residence, "Washington, D.C., and Idaho") == 1 & Name == "Catherine Mellon Conover"
(1 real change made)

. replace statefips2 = 36 if regexm(Residence, "New York and Greenwich, Conn.") == 1 & Name == "Sherman Cohen"
(0 real changes made)

. replace statefips2 = 36 if regexm(Residence, "Los Angeles, New York and Moscow") == 1 & Name == "Armand Hammer"
(0 real changes made)

. replace statefips3 = 6 if temp_city_3 == "Los Angeles"
(1 real change made)

. replace statefips2 = 36 if temp_city_2 == "New York City"
(0 real changes made)

. replace statefips3 = 100 if temp_city_3 == "Paris"
(1 real change made)

. replace statefips2 = 37 if regexm(Residence, "N. Carolina, Conn., Et Al.") == 1 & Name == "Richardson"
(1 real change made)

. replace statefips2 = 12 if regexm(Residence, "Centreville, Del.; Fla.") == 1
(1 real change made)

. replace statefips1 = 6 if regexm(Residence, "Columbus, Ohio; Calif.") == 1 
(0 real changes made)

. replace statefips2 = 48 if temp_city_2 == "Houston"
(0 real changes made)

. replace statefips2 = 6 if temp_city_2 == "Los Angeles"
(2 real changes made)

. replace statefips3 = 100 if temp_city_3 == "Moscow"
(2 real changes made)

. replace statefips2 = 39 if temp_city_2 == "Cleveland"
(0 real changes made)

. replace statefips2 = 100 if regexm(Residence, "Europe; Conn.") == 1
(1 real change made)

. replace statefips2 = 37 if regexm(Residence, "North Carolina; Conn.") == 1
(1 real change made)

. replace statefips2 = 31 if regexm(Residence, "Illinois; Nebraska") == 1
(1 real change made)

. replace statefips2 = 12 if regexm(Residence, "Centreville, Del.; Florida") == 1
(1 real change made)

. replace statefips2 = 51 if regexm(Residence, "Virginia; California") == 1
(1 real change made)

. replace statefips2 = 53 if regexm(Residence, "St. Paul; Wash. State") == 1
(1 real change made)

. replace statefips2 = 35 if regexm(Residence, "Calif; Nm") == 1
(1 real change made)

. replace statefips2 = 39 if regexm(Residence, "Delaware; Ohio") == 1
(1 real change made)

. replace statefips2 = 12 if regexm(Residence, "Denver; Fla") == 1
(1 real change made)

. replace statefips2 = 51 if regexm(Residence, "Virginia; S.C.") == 1
(1 real change made)

. replace statefips2 = 100 if regexm(Residence, "Europe & Connecticut") == 1
(1 real change made)

. replace statefips2 = 12 if regexm(Residence, "Delaware; Florida") == 1
(1 real change made)

. replace statefips1 = 51 if temp_city == "Middleburg"
(1 real change made)

. replace statefips2 = 6 if regexm(Residence, "Middleburg, Va., Calif.") == 1
(1 real change made)

. replace statefips1 = 6 if regexm(Residence, "Racho Santa Fe, California") == 1
(0 real changes made)

. replace statefips2 = 12 if regexm(Residence, "Newport Beach, Florida") == 1
(2 real changes made)

. replace statefips1 = 6 if regexm(Residence, "Vero Beach, California") == 1 
(0 real changes made)

. save "./data/stata_data/multi_city_generated.dta", replace
file ./data/stata_data/multi_city_generated.dta saved

. 
. use "./data/stata_data/temp_city_1_generated.dta", clear

. merge 1:1 Name A year SUFFIX Suffix suffix family NetWorth using "./data/stata_data/multi_city_generated.dta", keep(master match) upda
> te replace 

    Result                           # of obs.
    -----------------------------------------
    not matched                        15,168
        from master                    15,168  (_merge==1)
        from using                          0  (_merge==2)

    matched                               138
        not updated                       138  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. g Entity = 0

. replace Entity = 1 if regexm(city, "Reservation")==1
(0 real changes made)

. replace Entity = 2 if regexm(city, "County")==1
(93 real changes made)

. replace temp_city = strproper(strtrim(subinstr(temp_city, "County", "",.)))
(90 real changes made)

. keep Name lastname firstname midname year statefip* temp_city temp_city_2 temp_city_3 Residence Age Rank missing_vals Entity Source Ne
> tWorth Rank family

. unab test:_all

. di "`test'"
lastname firstname midname Name NetWorth Source year Rank Age Residence family statefips1 statefips2 statefips3 temp_city missing_vals t
> emp_city_2 temp_city_3 Entity

. local notoca "statefips1 statefips2 statefips3"

. local forresh: list test - notoca

. di "`forresh'"
lastname firstname midname Name NetWorth Source year Rank Age Residence family temp_city missing_vals temp_city_2 temp_city_3 Entity

. 
. // New reshape
. tempfile reshape1

. save `reshape1'
file C:\Users\l1djw01\AppData\Local\Temp\ST_4f88_000001.tmp saved

. use `reshape1', clear

. 
. // Reshape 1
. rename temp_city tempcity1

. rename temp_city_2 tempcity2

. rename temp_city_3 tempcity3

. g id = _n 

. reshape long tempcity, i(id) j(location_order) 
(note: j = 1 2 3)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                    15306   ->   45918
Number of variables                  20   ->      19
j variable (3 values)                     ->   location_order
xij variables:
          tempcity1 tempcity2 tempcity3   ->   tempcity
-----------------------------------------------------------------------------

. tempfile reshape2

. save `reshape2'
file C:\Users\l1djw01\AppData\Local\Temp\ST_4f88_000002.tmp saved

. 
. // Reshape 2
. use `reshape1', clear

. g id = _n

. reshape long statefips, i(id) j(location_order) 
(note: j = 1 2 3)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                    15306   ->   45918
Number of variables                  20   ->      19
j variable (3 values)                     ->   location_order
xij variables:
       statefips1 statefips2 statefips3   ->   statefips
-----------------------------------------------------------------------------

. tempfile reshape3

. save `reshape3'
file C:\Users\l1djw01\AppData\Local\Temp\ST_4f88_000003.tmp saved

. 
. // Merge two reshapes
. merge 1:1 Name year location_order id using `reshape2'

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            45,918  (_merge==3)
    -----------------------------------------

. drop temp_city temp_city_2 temp_city_3 statefips1 statefips2 statefips3 id

. rename tempcity temp_city

. drop _m

. 
. **reshape long statefips, i(`forresh') j(num) string
. 
. replace temp_city = strproper(strtrim(subinstr(temp_city, "  ", " ", .)))
(0 real changes made)

. g etype = 1

. local ki = 2

. foreach type in Comunidad Zona Reservation County{
  2. replace etype = `ki' if regexm(temp_city, "`type'")==1
  3. replace temp_city = strtrim(subinstr(temp_city, "`type'", "", .))
  4. local ki = `ki'+1
  5. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. foreach type in CDP Town City Village Borough{
  2.   replace temp_city = strtrim(subinstr(temp_city, " `type'", "", .))
  3. }
(0 real changes made)
(0 real changes made)
(308 real changes made)
(23 real changes made)
(0 real changes made)

. destring statefips, replace
statefips already numeric; no replace

. drop if statefips==. & year != "2002"
(29,712 observations deleted)

. 
. *FURTHER ADJUSTMENTS FROM THE EXCEL SPREADSHEET ON BAD MATCHES
. *SEE LOCALITY FOLDER FOR MORE DETAIL
. replace statefips=8 if temp_city=="Aspen" & statefips==6
(1 real change made)

. replace statefips=11 if temp_city=="Washington" & statefips==53 & inlist(year, "2009", "1995", "1988", "2014", "2013")
(13 real changes made)

. replace statefips=8 if temp_city=="Cherry Hills" & statefips==6
(1 real change made)

. replace statefips=18 if temp_city=="Crown Point" & statefips==48
(1 real change made)

. replace statefips=8 if temp_city=="Englewood" & statefips==6
(1 real change made)

. replace statefips=8 if temp_city=="Fort Collins" & statefips==6
(1 real change made)

. replace statefips=8 if temp_city=="Parker" & statefips==6
(1 real change made)

. replace statefips=6 if temp_city=="Woodbridge" & statefips==8
(0 real changes made)

. replace temp_city="Indian Wells" if temp_city=="Indian Springs" & statefips==8
(0 real changes made)

. replace temp_city="Indian Wells" if temp_city=="Indian Springs" & statefips==8
(0 real changes made)

. 
. replace statefips=25 if temp_city=="Framingham" & statefips==24
(1 real change made)

. replace statefips=25 if temp_city=="Hopkinton" & statefips==24
(1 real change made)

. replace statefips=25 if temp_city=="Milton" & statefips==24
(1 real change made)

. replace statefips=25 if temp_city=="Newton" & statefips==24
(1 real change made)

. 
. // Making changes to prevent bad merges.
. replace temp_city = "Augusta-Richmond" if temp_city == "Augusta" & statefips == 13
(8 real changes made)

. replace temp_city = "Setauket-East Setauket" if temp_city == "East Setauket" & statefips == 36
variable temp_city was str21 now str22
(14 real changes made)

. replace temp_city = "East Hampton" if temp_city == "Easthampton" & statefips == 36
(1 real change made)

. replace temp_city = "Islamorada, Of Islands" if temp_city == "Islamorada" & statefips == 12
(10 real changes made)

. replace temp_city = "Islamorada, Of Islands" if temp_city == "Islamoradora" & statefips == 12
(1 real change made)

. replace temp_city = "Jacksonville" if temp_city == "Jackson" & statefips == 12
(2 real changes made)

. replace temp_city = "Las Vegas" if temp_city == "La Vegas" & statefips == 32
(1 real change made)

. replace temp_city = "Lexington-Fayette Northwest" if temp_city == "Lexington" & statefips == 21
variable temp_city was str22 now str27
(10 real changes made)

. replace temp_city = "Louisville/Jefferson" if temp_city == "Louisville" & statefips == 21
(14 real changes made)

. replace temp_city = "Mill Neck" if temp_city == "Millneck" & statefips == 36
(2 real changes made)

. replace temp_city = "Newton" if temp_city == "Newton Centre" & statefips == 25
(18 real changes made)

. replace temp_city = "Rancho Santa Fe" if Residence == "Racho Santa Fe, California" & statefips == 6
(1 real change made)

. replace Residence = "Rancho Santa Fe, CA" if Residence == "Racho Santa Fe, California"
(1 real change made)

. replace temp_city = "Redwood" if temp_city == "Redwood Shores" & statefips == 6
(1 real change made)

. replace temp_city = "St. Petersburg" if temp_city == "Saint Petersburg" & statefips == 12
(3 real changes made)

. replace temp_city = "San Juan Island" if temp_city == "San Juan Islands" & statefips == 53
(20 real changes made)

. replace temp_city = "Southampton" if temp_city == "Southhampton" & statefips == 36
(1 real change made)

. replace temp_city = "St. Marys Point" if temp_city == "St Mary'S" & statefips == 27
(16 real changes made)

. replace temp_city = "St. Marys Point" if temp_city == "St Mary’S Point" & statefips == 27
(4 real changes made)

. replace temp_city = "Upper St. Clair" if temp_city == "Upper Saint Clair" & statefips == 42
(1 real change made)

. replace temp_city = "Virginia Beach" if temp_city == "Va Beach" & statefips == 51
(1 real change made)

. replace statefips = 11 if temp_city == "Washington" & Name == "John Davison Rockefeller"
(1 real change made)

. replace statefips = 11 if temp_city == "Washington" & Name == "Alice Sheets Marriott"
(1 real change made)

. replace statefips = 11 if temp_city == "Washington" & Name == "John Willard Marriott Jr"
(1 real change made)

. replace statefips = 11 if temp_city == "Washington" & Name == "Richard Edwin Marriott"
(1 real change made)

. replace temp_city = "Baton Rouge" if temp_city == "Wells" & Name == "Irene Wells Pennington" // Appears last name added in error to re
> sidence
(1 real change made)

. replace Residence = "Old Westbury, New York" if Name == "Steven Schonfeld" & year == "2009" // State accidentally left off, cross refe
> renced with Forbes magazine for the year in question
(1 real change made)

. replace temp_city = "Old Westbury" if Name == "Steven Schonfeld" & year == "2009"
(1 real change made)

. replace statefips = 36 if Name == "Steven Schonfeld" & year == "2009"
(1 real change made)

. 
. ** Fix incorrect state
. replace statefips = 51 if temp_city == "Charlottesville" & statefips == 36
(1 real change made)

. replace temp_city = "" if Residence == "Columbus, Ohio; Calif." & statefips == 6 & Source == "Publishing, broadcasting, bkg."
(1 real change made)

. replace statefips = 39 if Residence == "Columbus, Ohio; Calif." & Source == "Inheritance (media, banking)"
(1 real change made)

. replace statefips = 32 if temp_city == "Las Vegas"
(1 real change made)

. replace statefips = 12 if temp_city == "Palm Beach"
(1 real change made)

. replace statefips = 23 if Residence == "Portland, Me.; Florida" & temp_city == "Portland"
(1 real change made)

. replace statefips = 6 if temp_city == "Rancho Santa Fe"
(0 real changes made)

. replace temp_city = "Rancho Santa Fe" if Residence == "Racho Santa Fe, California" & statefips == 6
(0 real changes made)

. replace statefips = 12 if temp_city == "Vero Beach"
(1 real change made)

. 
. ** Several records for 2003 mislabeled Boston as being in Maryland (as well as other cities)
. replace Residence = "Boston, Massachusetts" if Residence == "Boston, Maryland" & year == "2003"
(6 real changes made)

. replace statefips = 25 if Residence == "Boston, Massachusetts"
(6 real changes made)

. replace Residence = "Concord, Massachusetts" if Residence == "Concord, Maryland" 
(1 real change made)

. replace statefips = 25 if Residence == "Concord, Massachusetts"
(1 real change made)

. 
. tempfile forbes

. save `forbes'
file C:\Users\l1djw01\AppData\Local\Temp\ST_4f88_000004.tmp saved

. merge m:1 temp_city statefips using "./data/stata_data/temp_crosswalk_for_CDPv4.dta",nogen keep(master match)
(note: variable temp_city was str27, now str61 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,199
        from master                     2,199  
        from using                          0  

    matched                            14,007  
    -----------------------------------------

. rename csa10 CSA

. rename cbsa10 CBSA

. rename csaname10 CSAname

. rename cbsaname10 CBSAname

. gen CA = CSA if CSA~=999
(4,617 missing values generated)

. replace CA = CBSA if CSA==999
(2,418 real changes made)

. replace CA = placefp if CSA==999 & CBSA==99999
(164 real changes made)

. 
. gen CAname = CSAname if CSA~=999
(4,617 missing values generated)

. replace CAname = CBSAname if CSA==999
(2,418 real changes made)

. replace CAname = temp_city if CSA==999 & CBSA==99999
(164 real changes made)

. 
. // Adding CA and County After Merge
. replace CA = 266 if temp_city == "Ada" & statefips == 26
(44 real changes made)

. replace CAname = "Grand Rapids-Muskegon-Holland, MI Combined Statistical Area" if temp_city == "Ada" & statefips == 26
(44 real changes made)

. replace cntyname = "Wood" if temp_city == "Ada" & statefips == 26 
(44 real changes made)

. replace county = 26081 if temp_city == "Ada" & statefips == 26
(44 real changes made)

. replace CA = 27500 if temp_city == "Afton" & statefips == 55
(10 real changes made)

. replace CAname = "Janesville, WI Metropolitan Statistical Area" if temp_city == "Afton" & statefips == 55
(10 real changes made)

. replace cntyname = "Rock" if temp_city == "Afton" & statefips == 55
(10 real changes made)

. replace county = 55105 if temp_city == "Afton" & statefips == 55
(10 real changes made)

. replace statefips = 12 if Name == "Micky Arison" & temp_city == "Bal Harbour"
(1 real change made)

. replace CA = 33100 if temp_city == "Bal Harbour" & statefips == 12
(1 real change made)

. replace CAname = "Miami-Fort Lauderdale-Pompano Beach, FL Metropolitan Statistical Area" if temp_city == "Bal Harbour" & statefips == 
> 12
(1 real change made)

. replace county = 12086 if temp_city == "Bal Harbour" & statefips == 12
(1 real change made)

. replace cntyname = "Miami-Dade" if temp_city == "Bal Harbour" & statefips == 12
(1 real change made)

. replace CA = 148 if temp_city == "Beacon Hill" & statefips == 25
(1 real change made)

. replace CAname = "Boston-Worcester-Manchester, MA-RI-NH Combined Statistical Area" if temp_city == "Beacon Hill" & statefips == 25
(1 real change made)

. replace county = 25025 if temp_city == "Beacon Hill" & statefips == 25
(1 real change made)

. replace cntyname = "Suffolk" if temp_city == "Beacon Hill" & statefips == 25
(1 real change made)

. replace county = 34035 if temp_city == "Bedminster"& statefips == 34
(22 real changes made)

. replace CA = 408 if temp_city == "Bedminster"& statefips == 34
(22 real changes made)

. replace CAname = "New York-Newark-Bridgeport, NY-NJ-CT-PA Combined Statistical Area" if temp_city == "Bedminster"& statefips == 34
(22 real changes made)

. replace cntyname = "Somerset" if temp_city == "Bedminster"& statefips == 34
(22 real changes made)

. replace CA = 408 if temp_city == "Brooklyn" & statefips == 36
(5 real changes made)

. replace CAname = "New York-Newark-Bridgeport, NY-NJ-CT-PA Combined Statistical Area" if temp_city == "Brooklyn" & statefips == 36
(5 real changes made)

. replace county = 36085 if temp_city == "Brooklyn" & statefips == 36
(5 real changes made)

. replace cntyname = "Richmond" if temp_city == "Brooklyn" & statefips == 36
(5 real changes made)

. replace CA = 408 if temp_city == "Campbell Hall" & statefips == 36
(1 real change made)

. replace CAname = "New York-Newark-Bridgeport, NY-NJ-CT-PA Combined Statistical Area" if temp_city == "Campbell Hall" & statefips == 36
(1 real change made)

. replace county = 36071 if temp_city == "Campbell Hall" & statefips == 36
(1 real change made)

. replace cntyname = "Orange" if temp_city == "Campbell Hall" & statefips == 36
(1 real change made)

. replace CA = 428 if temp_city == "Centerville" & statefips == 10
(2 real changes made)

. replace CAname = "Philadelphia-Camden-Vineland, PA-NJ-DE-MD Combined Statistical Area" if temp_city == "Centerville" & statefips == 10
(2 real changes made)

. replace county = 10003 if temp_city == "Centerville" & statefips == 10
(2 real changes made)

. replace cntyname = "New Castle" if temp_city == "Centerville" & statefips == 10
(2 real changes made)

. replace CA = 428 if temp_city == "Centreville" & statefips == 10
(4 real changes made)

. replace CAname = "Philadelphia-Camden-Vineland, PA-NJ-DE-MD Combined Statistical Area" if temp_city == "Centreville" & statefips == 10
(4 real changes made)

. replace county = 10003 if temp_city == "Centreville" & statefips == 10
(4 real changes made)

. replace cntyname = "New Castle" if temp_city == "Centreville" & statefips == 10
(4 real changes made)

. replace CA = 148 if temp_city == "Chelmsford" & statefips == 25
(2 real changes made)

. replace CAname = "Boston-Worcester-Manchester, MA-RI-NH Combined Statistical Area" if temp_city == "Chelmsford" & statefips == 25
(2 real changes made)

. replace county = 25017 if temp_city == "Chelmsford" & statefips == 25
(2 real changes made)

. replace cntyname = "Middlesex" if temp_city == "Chelmsford" & statefips == 25
(2 real changes made)

. replace CA = 148 if temp_city == "Chestnut Hill" & statefips == 25 // Spans multiple counties (we picked Middlesex)
(22 real changes made)

. replace CAname = "Boston-Worcester-Manchester, MA-RI-NH Combined Statistical Area" if temp_city == "Chestnut Hill" & statefips == 25
(22 real changes made)

. replace cntyname = "Middlesex" if temp_city == "Chestnut Hill" & statefips == 25
(22 real changes made)

. replace county = 25017 if temp_city == "Chestnut Hill" & statefips == 25
(22 real changes made)

. replace CA = 428 if temp_city == "Christiana Hundred" & statefips == 10
(3 real changes made)

. replace CAname = "Philadelphia-Camden-Vineland, PA-NJ-DE-MD Combined Statistical Area" if temp_city == "Christiana Hundred" & statefip
> s == 10
(3 real changes made)

. replace county = 10003 if temp_city == "Christiana Hundred" & statefips == 10
(3 real changes made)

. replace cntyname = "New Castle" if temp_city == "Christiana Hundred" & statefips == 10
(3 real changes made)

. replace CA = 99999 if temp_city == "Clark" & statefips == 56
(2 real changes made)

. replace CAname = "Clark, WY" if temp_city == "Clark" & statefips == 56
(2 real changes made)

. replace county = 56029 if temp_city == "Clark" & statefips == 56
(2 real changes made)

. replace cntyname = "Park" if temp_city == "Clark" & statefips == 56
(2 real changes made)

. replace CA = 148 if temp_city == "Cohassett" & statefips == 25
(11 real changes made)

. replace CAname = "Boston-Worcester-Manchester, MA-RI-NH Combined Statistical Area" if temp_city == "Cohassett" & statefips == 25
(11 real changes made)

. replace county = 25021 if temp_city == "Cohassett" & statefips == 25
(11 real changes made)

. replace cntyname = "Norfolk" if temp_city == "Cohassett" & statefips == 25
(11 real changes made)

. replace CA = 99999 if temp_city == "Devils Tower" & statefips == 56 // Rural and not in crosswalk
(5 real changes made)

. replace CAname = "Devil's Tower, WY" if temp_city == "Devils Tower" & statefips == 56
(5 real changes made)

. replace county = 56011 if temp_city == "Devils Tower" & statefips == 56
(5 real changes made)

. replace cntyname = "Crook" if temp_city == "Devils Tower" & statefips == 56 
(5 real changes made)

. replace CA = 99999 if temp_city == "Edgartown" & statefips == 25 // Rural and not in crosswalk
(1 real change made)

. replace CAname = "Edgartown, MA" if temp_city == "Edgartown" & statefips == 25
(1 real change made)

. replace county = 25007 if temp_city == "Edgartown" & statefips == 25
(1 real change made)

. replace cntyname = "Dukes" if temp_city == "Edgartown" & statefips == 25
(1 real change made)

. replace CA = 430 if temp_city == "Eightyfour" & statefips == 42
(4 real changes made)

. replace CAname = "Pittsburgh-New Castle, PA Combined Statistical Area" if temp_city == "Eightyfour" & statefips == 42
(4 real changes made)

. replace county = 42125 if temp_city == "Eightyfour" & statefips == 42
(4 real changes made)

. replace cntyname = "Washington" if temp_city == "Eightyfour" & statefips == 42
(4 real changes made)

. replace CA = 408 if temp_city == "Essex" & statefips == 34
(1 real change made)

. replace CAname = "New York-Newark-Bridgeport, NY-NJ-CT-PA Combined Statistical Area" if temp_city == "Essex" & statefips == 34
(1 real change made)

. replace county = 34013 if temp_city == "Essex" & statefips == 34
(1 real change made)

. replace cntyname = "Essex" if temp_city == "Essex" & statefips == 34
(1 real change made)

. replace CA = 548 if temp_city == "Fauquier" & statefips == 51
(20 real changes made)

. replace CAname = "Washington-Baltimore-Northern Virginia, DC-MD-VA-WV Combined Statistical Area" if temp_city == "Fauquier" & statefip
> s == 51
variable CAname was str76 now str77
(20 real changes made)

. replace county = 51061 if temp_city == "Fauquier" & statefips == 51
(20 real changes made)

. replace cntyname = "Fauquier" if temp_city == "Fauquier" & statefips == 51
(20 real changes made)

. replace CA = 408 if temp_city == "Flushing" & statefips == 36
(1 real change made)

. replace CAname = "New York-Newark-Bridgeport, NY-NJ-CT-PA Combined Statistical Area" if temp_city == "Flushing" & statefips == 36
(1 real change made)

. replace county = 36085 if temp_city == "Flushing" & statefips == 36
(1 real change made)

. replace cntyname = "Richmond" if temp_city == "Flushing" & statefips == 36
(1 real change made)

. replace CA = 428 if temp_city == "Gladwyne Pa" & statefips == 42
(1 real change made)

. replace CAname = "Philadelphia-Camden-Vineland, PA-NJ-DE-MD Combined Statistical Area" if temp_city == "Gladwyne Pa" & statefips == 42
(1 real change made)

. replace county = 42091 if temp_city == "Gladwyne Pa" & statefips == 42
(1 real change made)

. replace cntyname = "Montgomery" if temp_city == "Gladwyne Pa" & statefips == 42
(1 real change made)

. replace CA = 220 if temp_city == "Gladwyne" & statefips == 42
(9 real changes made)

. replace CAname = "Detroit-Warren-Flint, MI Combined Statistical Area" if temp_city == "Gladwyne" & statefips == 42
(9 real changes made)

. replace county = 42091 if temp_city == "Gladwyne" & statefips == 42
(9 real changes made)

. replace cntyname = "Montgomery" if temp_city == "Gladwyne" & statefips == 42
(9 real changes made)

. 
. replace CA = 220 if temp_city == "Gro Sse Pointe Farms" & statefips == 26
(1 real change made)

. replace CAname = "Detroit-Warren-Flint, MI Combined Statistical Area" if temp_city == "Gro Sse Pointe Farms" & statefips == 26
(1 real change made)

. replace county = 26163 if temp_city == "Gro Sse Pointe Farms" & statefips == 26
(1 real change made)

. replace cntyname = "Wayne" if temp_city == "Gro Sse Pointe Farms" & statefips == 26
(1 real change made)

. replace CA = 220 if temp_city == "Gro Sse Pointe Shores" & statefips == 26
(1 real change made)

. replace CAname = "Detroit-Warren-Flint, MI Combined Statistical Area" if temp_city == "Gro Sse Pointe Shores" & statefips == 26
(1 real change made)

. replace county = 26163 if temp_city == "Gro Sse Pointe Shores" & statefips == 26
(1 real change made)

. replace cntyname = "Wayne" if temp_city == "Gro Sse Pointe Shores" & statefips == 26
(1 real change made)

. replace CA = 220 if temp_city == "Grosse Point" & statefips == 26
(25 real changes made)

. replace CAname = "Detroit-Warren-Flint, MI Combined Statistical Area" if temp_city == "Grosse Point" & statefips == 26
(25 real changes made)

. replace county = 26163 if temp_city == "Grosse Point" & statefips == 26
(25 real changes made)

. replace cntyname = "Wayne" if temp_city == "Grosse Point" & statefips == 26
(25 real changes made)

. replace CA = 220 if temp_city == "Grosse Pte Shores" & statefips == 26
(1 real change made)

. replace CAname = "Detroit-Warren-Flint, MI Combined Statistical Area" if temp_city == "Grosse Pte Shores" & statefips == 26
(1 real change made)

. replace county = 26163 if temp_city == "Grosse Pte Shores" & statefips == 26
(1 real change made)

. replace cntyname = "Wayne" if temp_city == "Grosse Pte Shores" & statefips == 26
(1 real change made)

. replace CA = 220 if temp_city == "Hinckley" & statefips == 39
(3 real changes made)

. replace CAname = "Detroit-Warren-Flint, MI Combined Statistical Area" if temp_city == "Hinckley" & statefips == 39
(3 real changes made)

. replace county = 39103 if temp_city == "Hinckley" & statefips == 39
(3 real changes made)

. replace cntyname = "Medina" if temp_city == "Hinckley" & statefips == 39
(3 real changes made)

. replace CA = 148 if temp_city == "Hollis" & statefips == 33
(10 real changes made)

. replace CAname = "Boston-Worcester-Manchester, MA-RI-NH Combined Statistical Area" if temp_city == "Hollis" & statefips == 33
(10 real changes made)

. replace county = 33011 if temp_city == "Hollis" & statefips == 33
(10 real changes made)

. replace cntyname = "Hillsborough" if temp_city == "Hollis" & statefips == 33
(10 real changes made)

. replace CA = 348 if temp_city == "Holmby Hills" & statefips == 6
(20 real changes made)

. replace CAname = "Los Angeles-Long Beach-Riverside, CA Combined Statistical Area" if temp_city == "Holmby Hills" & statefips == 6
(20 real changes made)

. replace county = 6037 if temp_city == "Holmby Hills" & statefips == 6
(20 real changes made)

. replace cntyname = "Los Angeles" if temp_city == "Holmby Hills" & statefips == 6
(20 real changes made)

. replace CA = 348 if temp_city == "Holmby Hills" & statefips == 6
(0 real changes made)

. replace CAname = "Los Angeles-Long Beach-Riverside, CA Combined Statistical Area" if temp_city == "Holmby Hills" & statefips == 6
(0 real changes made)

. replace county = 6037 if temp_city == "Holmby Hills" & statefips == 6
(0 real changes made)

. replace cntyname = "Los Angeles" if temp_city == "Holmby Hills" & statefips == 6
(0 real changes made)

. replace CA = 428 if temp_city == "Huntingdon Valley" & statefips == 42
(5 real changes made)

. replace CAname = "Philadelphia-Camden-Vineland, PA-NJ-DE-MD Combined Statistical Area" if temp_city == "Huntingdon Valley" & statefips
>  == 42
(5 real changes made)

. replace county = 42091 if temp_city == "Huntingdon Valley" & statefips == 42
(5 real changes made)

. replace cntyname = "Montgomery" if temp_city == "Huntingdon Valley" & statefips == 42
(5 real changes made)

. replace CA = 428 if temp_city == "Huntington Valley" & statefips == 42
(3 real changes made)

. replace CAname  = "Philadelphia-Camden-Vineland, PA-NJ-DE-MD Combined Statistical Area" if temp_city == "Huntington Valley" & statefip
> s == 42
(3 real changes made)

. replace county = 42091 if temp_city == "Huntington Valley" & statefips == 42
(3 real changes made)

. replace cntyname = "Montgomery" if temp_city == "Huntington Valley" & statefips == 42
(3 real changes made)

. replace CA = 178 if temp_city == "Indian Hill" & statefips == 39
(5 real changes made)

. replace CAname = "Cincinnati-Middletown-Wilmington, OH-KY-IN Combined Statistical Area" if temp_city == "Indian Hill" & statefips == 3
> 9
(5 real changes made)

. replace county = 39061 if temp_city == "Indian Hill" & statefips == 39
(5 real changes made)

. replace cntyname = "Hamilton" if temp_city == "Indian Hill" & statefips == 39
(5 real changes made)

. replace temp_city = "Indian Wells" if temp_city == "Indian Springs" & statefips ==6
(1 real change made)

. replace CA = 348 if temp_city == "Indian Springs" & statefips ==6
(0 real changes made)

. replace CAname = "Los Angeles-Long Beach-Riverside, CA Combined Statistical Area" if temp_city == "Indian Springs" & statefips ==6
(0 real changes made)

. replace county = 6065 if temp_city == "Indian Springs" & statefips ==6
(0 real changes made)

. replace cntyname = "Riverside" if temp_city == "Indian Springs" & statefips ==6
(0 real changes made)

. replace CA = 206 if temp_city == "Irvine" & statefips == 48
(1 real change made)

. replace CAname = "Dallas-Fort Worth, TX Combined Statistical Area" if temp_city == "Irvine" & statefips == 48
(1 real change made)

. replace county = 48113 if temp_city == "Irvine" & statefips == 48
(1 real change made)

. replace cntyname = "Dallas" if temp_city == "Irvine" & statefips == 48
(1 real change made)

. replace CA = 26180 if temp_city == "Kahala Beach" & statefips == 15
(2 real changes made)

. replace CAname = "Honolulu, HI Metropolitan Statistical Area" if temp_city == "Kahala Beach" & statefips == 15
(2 real changes made)

. replace county = 15003 if temp_city == "Kahala Beach" & statefips == 15
(2 real changes made)

. replace cntyname = "Honolulu" if temp_city == "Kahala Beach" & statefips == 15
(2 real changes made)

. replace CA = 428 if temp_city == "Kennett Pike" & statefips == 10
(2 real changes made)

. replace CAname = "Philadelphia-Camden-Vineland, PA-NJ-DE-MD Combined Statistical Area" if temp_city == "Kennett Pike" & statefips == 1
> 0
(2 real changes made)

. replace county = 10003 if temp_city == "Kennett Pike" & statefips == 10
(2 real changes made)

. replace cntyname = "New Castle" if temp_city == "Kennett Pike" & statefips == 10
(2 real changes made)

. replace CA = 204  if temp_city == "King Ranch" & statefips == 48
(8 real changes made)

. replace CAname = "Corpus Christi-Kingsville, TX Combined Statistical Area" if temp_city == "King Ranch" & statefips == 48
(8 real changes made)

. replace county = 48273  if temp_city == "King Ranch" & statefips == 48
(8 real changes made)

. replace cntyname = "Kleberg"  if temp_city == "King Ranch" & statefips == 48
(8 real changes made)

. replace CA = 428 if temp_city == "Lafayette Hill" & statefips == 42
(13 real changes made)

. replace CAname = "Philadelphia-Camden-Vineland, PA-NJ-DE-MD Combined Statistical Area" if temp_city == "Lafayette Hill" & statefips ==
>  42
(13 real changes made)

. replace county = 42091 if temp_city == "Lafayette Hill" & statefips == 42
(13 real changes made)

. replace cntyname = "Montgomery" if temp_city == "Lafayette Hill" & statefips == 42
(13 real changes made)

. replace CA = 22660 if temp_city == "Larimer" & statefips == 8
(2 real changes made)

. replace CAname = "Fort Collins-Loveland, CO Metropolitan Statistical Area" if temp_city == "Larimer" & statefips == 8
(2 real changes made)

. replace county = 8069 if temp_city == "Larimer" & statefips == 8
(2 real changes made)

. replace cntyname = "Larimer" if temp_city == "Larimer" & statefips == 8
(2 real changes made)

. replace CA = 148 if temp_city == "Lincoln" & statefips == 25
(17 real changes made)

. replace CAname = "Boston-Worcester-Manchester, MA-RI-NH Combined Statistical Area" if temp_city == "Lincoln" & statefips == 25
(17 real changes made)

. replace county = 25017 if temp_city == "Lincoln" & statefips == 25
(17 real changes made)

. replace cntyname = "Middlesex" if temp_city == "Lincoln" & statefips == 25
(17 real changes made)

. replace CA = 27220 if temp_city == "Little Jackson Hole" & statefips == 56
(2 real changes made)

. replace CAname = "Little Jackson Hole, WY" if temp_city == "Little Jackson Hole" & statefips == 56
(2 real changes made)

. replace county = 56039 if temp_city == "Little Jackson Hole" & statefips == 56
(2 real changes made)

. replace cntyname = "Teton" if temp_city == "Little Jackson Hole" & statefips == 56
(2 real changes made)

. replace CA = 408 if temp_city == "Livingston" & statefips == 34
(6 real changes made)

. replace CAname = "New York-Newark-Bridgeport, NY-NJ-CT-PA Combined Statistical Area" if temp_city == "Livingston" & statefips == 34
(6 real changes made)

. replace county = 34013 if temp_city == "Livingston" & statefips == 34
(6 real changes made)

. replace cntyname = "Essex" if temp_city == "Livingston" & statefips == 34
(6 real changes made)

. replace CA = 408 if temp_city == "Lyndhurst" & statefips == 34
(4 real changes made)

. replace CAname = "New York-Newark-Bridgeport, NY-NJ-CT-PA Combined Statistical Area" if temp_city == "Lyndhurst" & statefips == 34
(4 real changes made)

. replace county = 34003 if temp_city == "Lyndhurst" & statefips == 34
(4 real changes made)

. replace cntyname = "Bergen" if temp_city == "Lyndhurst" & statefips == 34
(4 real changes made)

. replace CA = 216 if temp_city == "Magness" & statefips == 8
(1 real change made)

. replace CAname = "Denver-Aurora-Boulder, CO Combined Statistical Area" if temp_city == "Magness" & statefips == 8
(1 real change made)

. replace county = 8031 if temp_city == "Magness" & statefips == 8
(1 real change made)

. replace cntyname = "Denver" if temp_city == "Magness" & statefips == 8
(1 real change made)

. replace CA = 408 if temp_city == "Milburn" & statefips == 34
(3 real changes made)

. replace CAname = "New York-Newark-Bridgeport, NY-NJ-CT-PA Combined Statistical Area" if temp_city == "Milburn" & statefips == 34
(3 real changes made)

. replace county = 34013 if temp_city == "Milburn" & statefips == 34
(3 real changes made)

. replace cntyname = "Essex" if temp_city == "Milburn" & statefips == 34
(3 real changes made)

. replace CA = 548 if temp_city == "Millersville" & statefips == 24
(13 real changes made)

. replace CAname = "Washington-Baltimore-Northern Virginia, DC-MD-VA-WV Combined Statistical Area" if temp_city == "Millersville" & stat
> efips == 24
(13 real changes made)

. replace county = 24003 if temp_city == "Millersville" & statefips == 24
(13 real changes made)

. replace cntyname = "Anne Arundel" if temp_city == "Millersville" & statefips == 24
(13 real changes made)

. replace statefips = 10 if temp_city == "Montchanin"
(0 real changes made)

. replace CA = 428 if temp_city == "Montchanin" & statefips == 10
(55 real changes made)

. replace CAname = "Philadelphia-Camden-Vineland, PA-NJ-DE-MD Combined Statistical Area" if temp_city == "Montchanin" & statefips == 10
(55 real changes made)

. replace county = 10003 if temp_city == "Montchanin" & statefips == 10
(55 real changes made)

. replace cntyname = "New Castle" if temp_city == "Montchanin" & statefips == 10
(55 real changes made)

. replace CA = 428 if temp_city == "Montchamin" & statefips == 10
(0 real changes made)

. replace CAname = "Philadelphia-Camden-Vineland, PA-NJ-DE-MD Combined Statistical Area" if temp_city == "Montchamin" & statefips == 10
(0 real changes made)

. replace county = 10003 if temp_city == "Montchamin" & statefips == 10
(0 real changes made)

. replace cntyname = "New Castle" if temp_city == "Montchamin" & statefips == 10
(0 real changes made)

. replace CA = 408 if temp_city == "Morris" & statefips == 34
(1 real change made)

. replace CAname = "New York-Newark-Bridgeport, NY-NJ-CT-PA Combined Statistical Area" if temp_city == "Morris" & statefips == 34
(1 real change made)

. replace county = 34027 if temp_city == "Morris" & statefips == 34
(1 real change made)

. replace cntyname = "Morris" if temp_city == "Morris" & statefips == 34
(1 real change made)

. replace CA = 348 if temp_city == "N Hollywood" & statefips == 6
(1 real change made)

. replace CAname = "Los Angeles-Long Beach-Riverside, CA Combined Statistical Area" if temp_city == "N Hollywood" & statefips == 6
(1 real change made)

. replace county = 6037 if temp_city == "N Hollywood" & statefips == 6
(1 real change made)

. replace cntyname = "Los Angeles" if temp_city == "N Hollywood" & statefips == 6
(1 real change made)

. replace CA = 488 if temp_city == "Napa Valley" & statefips == 6
(1 real change made)

. replace CAname = "San Jose-San Francisco-Oakland, CA Combined Statistical Area" if temp_city == "Napa Valley" & statefips == 6
(1 real change made)

. replace county = 6055 if temp_city == "Napa Valley" & statefips == 6
(1 real change made)

. replace cntyname = "Napa" if temp_city == "Napa Valley" & statefips == 6
(1 real change made)

. replace CA = 408 if temp_city == "New Canaan" & statefips == 9
(5 real changes made)

. replace CAname = "New York-Newark-Bridgeport, NY-NJ-CT-PA Combined Statistical Area" if temp_city == "New Canaan" & statefips == 9
(5 real changes made)

. replace county = 9001 if temp_city == "New Canaan" & statefips == 9
(5 real changes made)

. replace cntyname = "Fairfield" if temp_city == "New Canaan" & statefips == 9
(5 real changes made)

. replace CA = 408 if temp_city == "New Vernon" & statefips == 34
(8 real changes made)

. replace CAname = "New York-Newark-Bridgeport, NY-NJ-CT-PA Combined Statistical Area" if temp_city == "New Vernon" & statefips == 34
(8 real changes made)

. replace county = 34027 if temp_city == "New Vernon" & statefips == 34
(8 real changes made)

. replace cntyname = "Morris" if temp_city == "New Vernon" & statefips == 34
(8 real changes made)

. replace CA = 348 if temp_city == "Newport Coast" & statefips == 6
(9 real changes made)

. replace CAname = "Los Angeles-Long Beach-Riverside, CA Combined Statistical Area" if temp_city == "Newport Coast" & statefips == 6
(9 real changes made)

. replace county = 6059 if temp_city == "Newport Coast" & statefips == 6
(9 real changes made)

. replace cntyname = "Orange" if temp_city == "Newport Coast" & statefips == 6
(9 real changes made)

. replace CA = 428 if temp_city == "Newtown Square" & statefips == 42
(16 real changes made)

. replace CAname = "Philadelphia-Camden-Vineland, PA-NJ-DE-MD Combined Statistical Area" if temp_city == "Newtown Square" & statefips ==
>  42
(16 real changes made)

. replace county = 42045 if temp_city == "Newtown Square" & statefips == 42
(16 real changes made)

. replace cntyname = "Delaware" if temp_city == "Newtown Square" & statefips == 42
(16 real changes made)

. replace CA = 348 if temp_city == "North Hollywood" & statefips == 6
(1 real change made)

. replace CAname = "Los Angeles-Long Beach-Riverside, CA Combined Statistical Area" if temp_city == "North Hollywood" & statefips == 6
(1 real change made)

. replace county = 6037 if temp_city == "North Hollywood" & statefips == 6
(1 real change made)

. replace cntyname = "Los Angeles" if temp_city == "North Hollywood" & statefips == 6
(1 real change made)

. replace CA = 28580 if temp_city == "Ocean Reef" & statefips == 12
(1 real change made)

. replace CAname = "Key West, FL Micropolitan Statistical Area" if temp_city == "Ocean Reef" & statefips == 12
(1 real change made)

. replace county = 12087 if temp_city == "Ocean Reef" & statefips == 12
(1 real change made)

. replace cntyname = "Monroe" if temp_city == "Ocean Reef" & statefips == 12
(1 real change made)

. replace CA = 35980 if temp_city == "Old Lyme" & statefips == 9
(1 real change made)

. replace CAname = "Norwich-New London, CT Metropolitan Statistical Area" if temp_city == "Old Lyme" & statefips == 9
(1 real change made)

. replace county = 9011 if temp_city == "Old Lyme" & statefips == 9
(1 real change made)

. replace cntyname = "New London" if temp_city == "Old Lyme" & statefips == 9
(1 real change made)

. replace temp_city = "Palisades" if temp_city == "Pacific Palisades" & Name == "James Chambers" // Incorrect temp_city
(2 real changes made)

. replace CA = 408 if temp_city == "Palisades" 
(2 real changes made)

. replace CAname = "New York-Newark-Bridgeport, NY-NJ-CT-PA Combined Statistical Area" if temp_city == "Palisades" 
(2 real changes made)

. replace county = 36087 if temp_city == "Palisades"
(2 real changes made)

. replace cntyname = "Rockland" if temp_city == "Palisades"
(2 real changes made)

. replace CA = 408 if temp_city == "Purchase" & statefips == 36
(1 real change made)

. replace CAname = "New York-Newark-Bridgeport, NY-NJ-CT-PA Combined Statistical Area" if temp_city == "Purchase" & statefips == 36
(1 real change made)

. replace county = 36119 if temp_city == "Purchase" & statefips == 36
(1 real change made)

. replace cntyname = "Westchester" if temp_city == "Purchase" & statefips == 36
(1 real change made)

. replace CA = 428 if temp_city == "Radnor" & statefips == 42
(6 real changes made)

. replace CAname = "Philadelphia-Camden-Vineland, PA-NJ-DE-MD Combined Statistical Area" if temp_city == "Radnor" & statefips == 42
(6 real changes made)

. replace county = 42045 if temp_city == "Radnor" & statefips == 42
(6 real changes made)

. replace cntyname = "Delaware" if temp_city == "Radnor" & statefips == 42
(6 real changes made)

. replace CA = 428 if temp_city == "Rockland" & statefips == 10
(5 real changes made)

. replace CAname = "Philadelphia-Camden-Vineland, PA-NJ-DE-MD Combined Statistical Area" if temp_city == "Rockland" & statefips == 10
(5 real changes made)

. replace county = 10003 if temp_city == "Rockland" & statefips == 10
(5 real changes made)

. replace cntyname = "New Castle" if temp_city == "Rockland" & statefips == 10
(5 real changes made)

. replace CA = 428 if temp_city == "Rydal" & statefips == 42
(4 real changes made)

. replace CAname = "Philadelphia-Camden-Vineland, PA-NJ-DE-MD Combined Statistical Area" if temp_city == "Rydal" & statefips == 42
(4 real changes made)

. replace county = 42091 if temp_city == "Rydal" & statefips == 42
(4 real changes made)

. replace cntyname = "Montgomery" if temp_city == "Rydal" & statefips == 42
(4 real changes made)

. replace CA = 148 if temp_city == "Rye" & statefips == 33
(8 real changes made)

. replace CAname = "Boston-Worcester-Manchester, MA-RI-NH Combined Statistical Area" if temp_city == "Rye" & statefips == 33
(8 real changes made)

. replace county = 33015 if temp_city == "Rye" & statefips == 33
(8 real changes made)

. replace cntyname = "Rockingham" if temp_city == "Rye" & statefips == 33
(8 real changes made)

. replace CA = 99999 if temp_city == "Seal Cove" & statefips == 23 // Rural, but no placefp
(4 real changes made)

. replace CAname = "Seal Cove, ME" if temp_city == "Seal Cove" & statefips == 23 
(4 real changes made)

. replace county = 23009 if temp_city == "Seal Cove" & statefips == 23
(4 real changes made)

. replace cntyname = "Hancock" if temp_city == "Seal Cove" & statefips == 23
(4 real changes made)

. replace CA = 430 if temp_city == "Shadyside" & statefips == 42
(7 real changes made)

. replace CAname = "Pittsburgh-New Castle, PA Combined Statistical Area" if temp_city == "Shadyside" & statefips == 42
(7 real changes made)

. replace county = 42003 if temp_city == "Shadyside" & statefips == 42
(7 real changes made)

. replace cntyname = "Allegheny" if temp_city == "Shadyside" & statefips == 42
(7 real changes made)

. replace CA = 312 if temp_city == "Shawnee Mission" & statefips == 20
(2 real changes made)

. replace CAname = "Kansas City-Overland Park-Kansas City, MO-KS Combined Statistical Area" if temp_city == "Shawnee Mission" & statefip
> s == 20
(2 real changes made)

. replace county = 20091 if temp_city == "Shawnee Mission" & statefips == 20
(2 real changes made)

. replace cntyname = "Johnson" if temp_city == "Shawnee Mission" & statefips == 20
(2 real changes made)

. replace CA = 148 if temp_city == "Sherborn" & statefips == 25
(1 real change made)

. replace CAname = "Boston-Worcester-Manchester, MA-RI-NH Combined Statistical Area" if temp_city == "Sherborn" & statefips == 25
(1 real change made)

. replace county = 25017 if temp_city == "Sherborn" & statefips == 25
(1 real change made)

. replace cntyname = "Middlesex" if temp_city == "Sherborn" & statefips == 25
(1 real change made)

. replace CA = 312 if temp_city == "Stilwell" & statefips == 20
(5 real changes made)

. replace CAname = "Kansas City-Overland Park-Kansas City, MO-KS Combined Statistical Area" if temp_city == "Stilwell" & statefips == 20
(5 real changes made)

. replace county = 20091 if temp_city == "Stilwell" & statefips == 20
(5 real changes made)

. replace cntyname = "Johnson" if temp_city == "Stilwell" & statefips == 20
(5 real changes made)

. replace CA = 148 if temp_city == "Stratham" & statefips == 33
(12 real changes made)

. replace CAname = "Boston-Worcester-Manchester, MA-RI-NH Combined Statistical Area" if temp_city == "Stratham" & statefips == 33
(12 real changes made)

. replace county = 33015 if temp_city == "Stratham" & statefips == 33
(12 real changes made)

. replace cntyname = "Rockingham" if temp_city == "Stratham" & statefips == 33
(12 real changes made)

. replace CA = 408 if temp_city == "Hunterdon" & statefips == 34
(1 real change made)

. replace CAname = "New York-Newark-Bridgeport, NY-NJ-CT-PA Combined Statistical Area" if temp_city == "Hunterdon" & statefips == 34
(1 real change made)

. replace county = 34019 if temp_city == "Hunterdon" & statefips == 34
(1 real change made)

. replace cntyname = "Hunterdon" if temp_city == "Hunterdon" & statefips == 34
(1 real change made)

. replace temp_city = "Indian Springs" if temp_city == "Indian Wells" & statefips ==6
(1 real change made)

. replace CA = 46380 if temp_city == "Indian Springs" & statefips == 6
(1 real change made)

. replace CAname = "Ukiah, CA Micropolitan Statistical Area" if temp_city == "Indian Springs" & statefips == 6
(1 real change made)

. replace county = 6045 if temp_city == "Indian Springs" & statefips == 6
(1 real change made)

. replace cntyname = "Mendocino" if temp_city == "Indian Springs" & statefips == 6
(1 real change made)

. replace CA = 408 if temp_city == "Pottersville" & statefips == 34
(2 real changes made)

. replace CAname = "New York-Newark-Bridgeport, NY-NJ-CT-PA Combined Statistical Area" if temp_city == "Pottersville" & statefips == 34
(2 real changes made)

. replace county = 34035 if temp_city == "Pottersville" & statefips == 34
(2 real changes made)

. replace cntyname = "Somerset" if temp_city == "Pottersville" & statefips == 34
(2 real changes made)

. replace CA = 428 if temp_city == "Strafford" & statefips == 42 // Spans two counties
(9 real changes made)

. replace CAname = "Philadelphia-Camden-Vineland, PA-NJ-DE-MD Combined Statistical Area" if temp_city == "Strafford" & statefips == 42
(9 real changes made)

. replace cntyname = "Delaware" if temp_city == "Strafford" & statefips == 42
(9 real changes made)

. replace county = 42045 if temp_city == "Strafford" & statefips == 42
(9 real changes made)

. replace CA = 428 if temp_city == "Stratford" & statefips == 42 // Spans two counties
(0 real changes made)

. replace CAname = "Philadelphia-Camden-Vineland, PA-NJ-DE-MD Combined Statistical Area" if temp_city == "Stratford" & statefips == 42
(0 real changes made)

. replace CA = 428 if temp_city == "Villanova" & statefips == 42 // Spans two counties
(15 real changes made)

. replace CAname = "Philadelphia-Camden-Vineland, PA-NJ-DE-MD Combined Statistical Area" if temp_city == "Villanova" & statefips == 42 
(15 real changes made)

. replace cntyname = "Delaware" if temp_city == "Villanova" & statefips == 42
(15 real changes made)

. replace county = 42045 if temp_city == "Villanova" & statefips == 42
(15 real changes made)

. replace temp_city = "Waban" if temp_city == "Wabun" & statefips == 25 // City spelled incorrectly
(1 real change made)

. replace CA = 148 if temp_city == "Waban" & statefips == 25
(1 real change made)

. replace CAname = "Boston-Worcester-Manchester, MA-RI-NH Combined Statistical Area" if temp_city == "Waban" & statefips == 25
(1 real change made)

. replace county = 25017 if temp_city == "Waban" & statefips == 25
(1 real change made)

. replace cntyname = "Middlesex" if temp_city == "Waban" & statefips == 25
(1 real change made)

. replace CA = 148 if temp_city == "Wayland" & statefips == 25
(6 real changes made)

. replace CAname = "Boston-Worcester-Manchester, MA-RI-NH Combined Statistical Area" if temp_city == "Wayland" & statefips == 25
(6 real changes made)

. replace county = 25017 if temp_city == "Wayland" & statefips == 25
(6 real changes made)

. replace cntyname = "Middlesex" if temp_city == "Wayland" & statefips == 25
(6 real changes made)

. replace CA = 408 if temp_city == "Westchester" & statefips == 36
(23 real changes made)

. replace CAname = "New York-Newark-Bridgeport, NY-NJ-CT-PA Combined Statistical Area" if temp_city == "Westchester" & statefips == 36
(23 real changes made)

. replace county = 36119 if temp_city == "Westchester" & statefips == 36
(23 real changes made)

. replace cntyname = "Westchester" if temp_city == "Westchester" & statefips == 36
(23 real changes made)

. replace CA = 148 if temp_city == "Weston" & statefips == 25
(1 real change made)

. replace CAname = "Boston-Worcester-Manchester, MA-RI-NH Combined Statistical Area" if temp_city == "Weston" & statefips == 25 
(1 real change made)

. replace county =25017 if temp_city == "Weston" & statefips == 25
(1 real change made)

. replace cntyname = "Middlesex" if temp_city == "Weston" & statefips == 25
(1 real change made)

. replace CA = 408 if temp_city == "Woodbridge" & statefips == 9
(2 real changes made)

. replace CAname = "New York-Newark-Bridgeport, NY-NJ-CT-PA Combined Statistical Area" if temp_city == "Woodbridge" & statefips == 9
(2 real changes made)

. replace county = 9009 if temp_city == "Woodbridge" & statefips == 9
(2 real changes made)

. replace cntyname = "New Haven" if temp_city == "Woodbridge" & statefips == 9
(2 real changes made)

. replace CA = 428 if temp_city == "Wynnewood" & statefips == 42
(22 real changes made)

. replace CAname = "Philadelphia-Camden-Vineland, PA-NJ-DE-MD Combined Statistical Area" if temp_city == "Wynnewood" & statefips == 42
(22 real changes made)

. replace cntyname = "Delaware" if temp_city == "Wynnewood" & statefips == 42
(22 real changes made)

. replace county = 42045 if temp_city == "Wynnewood" & statefips == 42
(22 real changes made)

. replace county = 42091 if temp_city == "Woodbridge" & statefips == 9
(2 real changes made)

. replace cntyname = "Montgomery" if temp_city == "Woodbridge" & statefips == 9
(2 real changes made)

. 
. /*
> // Merging in 2017 Census file
> tempfile beforemerge
> save `beforemerge'
> import excel using "./data/raw_data/2017_Gaz_cbsa_national.xlsx",firstrow clear
> save "./data/stata_data/2017_Gaz_cbsa_national", replace
> use `beforemerge', clear
> merge m:1 CBSA using "./data/stata_data/2017_Gaz_cbsa_national.dta", update replace keep(master match) nogen
> */
. 
. *Manual fixes for the non-merged data
. *use "./data/stata_data/Forbes_400_locality_data_CDP.dta", clear
. *drop if missing_vals!=1 & statefips==100
. *Non-matched Las Vegas data
. *drop if m==2 & statefips==4
. 
. // Trying to fix formatting
. replace Residence = "Singapore" if Name == "Robert M Friedland" & year == "2011"
(1 real change made)

. 
. // Fixing further CAname issues
. replace CAname = "Boston-Worcester-Manchester, MA-RI-NH Combined Statistical Area" if CA == 148
(0 real changes made)

. replace CAname = "Philadelphia-Camden-Vineland, PA-NJ-DE-MD Combined Statistical Area" if CA == 428
(0 real changes made)

. replace CAname = "Grand Rapids-Muskegon-Holland, MI Combined Statistical Area" if CA == 266
(0 real changes made)

. replace CAname = "Corpus Christi-Kingsville, TX Combined Statistical Area" if CA == 204
(0 real changes made)

. replace CAname = "Washington-Baltimore-Northern Virginia, DC-MD-VA-WV Combined Statistical Area" if CA == 548
(450 real changes made)

. replace CAname = "Detroit-Warren-Flint, MI Combined Statistical Area" if CA == 220
(0 real changes made)

. replace CAname = "Cincinnati-Middletown-Wilmington, OH-KY-IN Combined Statistical Area" if CA == 178
(0 real changes made)

. replace CAname = "New York-Newark-Bridgeport, NY-NJ-CT-PA Combined Statistical Area" if CA == 408
(0 real changes made)

. replace CAname = "Los Angeles-Long Beach-Riverside, CA Combined Statistical Area" if CA == 348
(0 real changes made)

. replace CAname = "Jackson, WY" if CA == 27220
(28 real changes made)

. replace CAname = "Cleveland-Akron-Elyria, OH Combined Statistical Area" if CA == 184
(0 real changes made)

. /*
> //Merge in population data
> rename county fips
> destring year, replace
> merge m:1 year fips using "./data/stata_data/population.dta", nogen keep(master match)
> */
. save "./data/stata_data/Forbes_400_locality_data_CDP.dta", replace
file ./data/stata_data/Forbes_400_locality_data_CDP.dta saved

. 
. /*
> *Count how many merges there are for each year
> tab year if m==3
> tab statefips if m==3
> tab statefips if m==2
> tab missing_vals if m==2
> *Try and get a feel of any bad merges (in the case where an individual may have
> *two localities and the previous reshape may create a false match)
> duplicates report Name Age Rank Residence year m
> 
> duplicates tag year Name Age Rank, g(dup)
> g bad_merge = 1 if m==2
> *Duplicates of non-merges
> g dup_bad_loc = dup if dup!=0 & m==2
> *Duplicate names with a positive merge (in case of multiple residences)
> g mult_loc = dup if dup!=0 & m==3
> g good_merge = m if m==3
> tabstat bad_merge dup_bad_loc mult_loc good_merge, by(year) stat(count)
> */
. 
. cap log close
